#pragma once

/***************************** MVX303_HDMI ********************************************/
//
//- 以下为 MVX303_HDMI    支持小于297M，且非宽屏的所有分辨率 
//- 支持50Hz,60Hz,75Hz,85Hz等 ， 以及支持部分Flexview的分辨率， 且仅支持1x2,1x3,1x1水平分割模式，以及3x1,2x1等垂直模式  
//-----------------------------------<<< 中文版 >>>-----------------------------------------------------------
#define TOTAL_MVX303_HDMI_TIMINGS 78
#ifndef ENGLISHVER
CString m_MVX303_HDMI_strTimings[] = {
	//三通道  1x3 水平
	_T("3840x1024 @ 60Hz(1x3 Mode 水平)(单屏 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("3840x960  @ 60Hz(1x3 Mode 水平)(单屏 1280x960 @ 60Hz)"),     /* mode 2  */
	_T("3840x800  @ 60Hz(1x3 Mode 水平)(单屏 1280x800 @ 60Hz)"),     /* mode 4  */
	_T("3840x768  @ 60Hz(1x3 Mode 水平)(单屏 1280x768 @ 60Hz)"),     /* mode 5  */
	_T("3840x720  @ 60Hz(1x3 Mode 水平)(单屏 1280x720 @ 60Hz)"),     /* mode 7  */
	_T("3072x768  @ 60Hz(1x3 Mode 水平)(单屏 1024x768 @ 60Hz)"),     /* mode 9  */
	_T("3072x768  @ 75Hz(1x3 Mode 水平)(单屏 1024x768 @ 75Hz)"),     /* mode 10  */
	_T("3072x768  @ 85Hz(1x3 Mode 水平)(单屏 1024x768 @ 85Hz)"),     /* mode 11 */
	_T("2400x600  @ 60Hz(1x3 Mode 水平)(单屏 800x600  @ 60Hz)"),     /* mode 12 */
	_T("2400x600  @ 75Hz(1x3 Mode 水平)(单屏 800x600  @ 75Hz)"),     /* mode 13 */
	_T("2400x600  @ 85Hz(1x3 Mode 水平)(单屏 800x600  @ 85Hz)"),     /* mode 14 */
	_T("2400x480  @ 60Hz(1x3 Mode 水平)(单屏 800x480  @ 60Hz)"),     /* mode 15 */
	_T("1920x480  @ 60Hz(1x3 Mode 水平)(单屏 640x480  @ 60Hz)"),     /* mode 16 */
	_T("1920x480  @ 75Hz(1x3 Mode 水平)(单屏 640x480  @ 75Hz)"),     /* mode 17 */
	_T("1920x480  @ 85Hz(1x3 Mode 水平)(单屏 640x480  @ 85Hz)"),     /* mode 18 */

	//两通道 1x2  水平
	_T("3840x1200 @ 50Hz(1x2 Mode 水平)(单屏 1920x1200 @ 50Hz)"),     /* mode 33 */
	_T("3840x1080 @ 60Hz(1x2 Mode 水平)(单屏 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("3360x1050 @ 60Hz(1x2 Mode 水平)(单屏 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("2880x900  @ 60Hz(1x2 Mode 水平)(单屏 1440x900  @ 60Hz)"),     /* mode 38 */
	_T("2720x768  @ 60Hz(1x2 Mode 水平)(单屏 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("2560x1024 @ 60Hz(1x2 Mode 水平)(单屏 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode 水平)(单屏 1280x1024 @ 75Hz)"),     /* mode 44 */
	_T("2560x960  @ 60Hz(1x2 Mode 水平)(单屏 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode 水平)(单屏 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode 水平)(单屏 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("2560x720  @ 60Hz(1x2 Mode 水平)(单屏 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("2048x768  @ 60Hz(1x2 Mode 水平)(单屏 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode 水平)(单屏 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode 水平)(单屏 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode 水平)(单屏 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode 水平)(单屏 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode 水平)(单屏 800x600   @ 85Hz)"),     /* mode 57 */

	//三通道 3x1 垂直
	_T("1280x3072 @ 60Hz(3x1 Mode 垂直)(单屏 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("1280x2880 @ 60Hz(3x1 Mode 垂直)(单屏 1280x960  @ 60Hz)"),     /* mode 2  */
	_T("1280x2400 @ 60Hz(3x1 Mode 垂直)(单屏 1280x800  @ 60Hz)"),     /* mode 4  */
	_T("1280x2304 @ 60Hz(3x1 Mode 垂直)(单屏 1280x768  @ 60Hz)"),     /* mode 5  */
	_T("1280x2160 @ 60Hz(3x1 Mode 垂直)(单屏 1280x720  @ 60Hz)"),     /* mode 7  */
	_T("1024x2304 @ 60Hz(3x1 Mode 垂直)(单屏 1024x768  @ 60Hz)"),     /* mode 9  */
	_T("1024x2304 @ 75Hz(3x1 Mode 垂直)(单屏 1024x768  @ 75Hz)"),     /* mode 10  */
	_T("1024x2304 @ 85Hz(3x1 Mode 垂直)(单屏 1024x768  @ 85Hz)"),     /* mode 11 */
	_T("800x1800  @ 60Hz(3x1 Mode 垂直)(单屏 800x600   @ 60Hz)"),     /* mode 12 */
	_T("800x1800  @ 75Hz(3x1 Mode 垂直)(单屏 800x600   @ 75Hz)"),     /* mode 13 */
	_T("800x1800  @ 85Hz(3x1 Mode 垂直)(单屏 800x600   @ 85Hz)"),     /* mode 14 */
	_T("800x1440  @ 60Hz(3x1 Mode 垂直)(单屏 800x480   @ 60Hz)"),     /* mode 15 */
	_T("640x1440  @ 60Hz(3x1 Mode 垂直)(单屏 640x480   @ 60Hz)"),     /* mode 16 */
	_T("640x1440  @ 75Hz(3x1 Mode 垂直)(单屏 640x480   @ 75Hz)"),     /* mode 17 */
	_T("640x1440  @ 85Hz(3x1 Mode 垂直)(单屏 640x480   @ 85Hz)"),     /* mode 18 */

	//两通道 2x1 垂直
	_T("1920x2400 @ 50Hz(2x1 Mode 垂直)(单屏 1920x1200 @ 50Hz)"),     /* mode 33 */
	_T("1920x2160 @ 60Hz(2x1 Mode 垂直)(单屏 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("1680x2100 @ 60Hz(2x1 Mode 垂直)(单屏 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("1440x1800 @ 60Hz(2x1 Mode 垂直)(单屏 1440x900  @ 60Hz)"),     /* mode 38 */
	_T("1360x1536 @ 60Hz(2x1 Mode 垂直)(单屏 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("1280x2048 @ 60Hz(2x1 Mode 垂直)(单屏 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("1280x2048 @ 75Hz(2x1 Mode 垂直)(单屏 1280x1024 @ 75Hz)"),     /* mode 44 */
	_T("1280x1920 @ 60Hz(2x1 Mode 垂直)(单屏 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("1280x1600 @ 60Hz(2x1 Mode 垂直)(单屏 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("1280x1536 @ 60Hz(2x1 Mode 垂直)(单屏 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("1280x1440 @ 60Hz(2x1 Mode 垂直)(单屏 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("1024x1536 @ 60Hz(2x1 Mode 垂直)(单屏 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("1024x1536 @ 75Hz(2x1 Mode 垂直)(单屏 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("1024x1536 @ 85Hz(2x1 Mode 垂直)(单屏 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("800x1200  @ 60Hz(2x1 Mode 垂直)(单屏 800x600   @ 60Hz)"),     /* mode 55 */
	_T("800x1200  @ 75Hz(2x1 Mode 垂直)(单屏 800x600   @ 75Hz)"),     /* mode 56 */
	_T("800x1200  @ 85Hz(2x1 Mode 垂直)(单屏 800x600   @ 85Hz)"),     /* mode 57 */

	//单屏 1x1模式
	_T("800x600  @ 60Hz(1x1 Mode 单屏)"),
	_T("1024x768 @ 60Hz(1x1 Mode 单屏)"),
	_T("1280x720 @ 60Hz(1x1 Mode 单屏)"),
	_T("1280x800 @ 60Hz(1x1 Mode 单屏)"),
	_T("1280x960 @ 60Hz(1x1 Mode 单屏)"),
	_T("1280x1024 @ 60Hz(1x1 Mode 单屏)"),
	_T("1366x768  @ 60Hz(1x1 Mode 单屏)"),
	_T("1400x1050 @ 60Hz(1x1 Mode 单屏)"),
	_T("1440x900  @ 60Hz(1x1 Mode 单屏)"),
	_T("1600x1200 @ 60Hz(1x1 Mode 单屏)"),
	_T("1680x1050 @ 60Hz(1x1 Mode 单屏)"),
	_T("1920x1080 @ 60Hz(1x1 Mode 单屏)"),
	_T("1920x1200 @ 60Hz(1x1 Mode 单屏)"),
	_T("3840x2160 @ 30Hz(1x1 Mode 单屏)"),

	_T("END"),
};
//-----------------------------------<<<  英文版 >>>----------------------------------------------------------
#else
CString m_MVX303_HDMI_strTimings[] = {
	//三通道  1x3 Horizontal
	_T("3840x1024 @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("3840x960  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x960 @ 60Hz)"),     /* mode 2  */
	_T("3840x800  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x800 @ 60Hz)"),     /* mode 4  */
	_T("3840x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x768 @ 60Hz)"),     /* mode 5  */
	_T("3840x720  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x720 @ 60Hz)"),     /* mode 7  */
	_T("3072x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1024x768 @ 60Hz)"),     /* mode 9  */
	_T("3072x768  @ 75Hz(1x3 Mode Horizontal)(Single-screen 1024x768 @ 75Hz)"),     /* mode 10  */
	_T("3072x768  @ 85Hz(1x3 Mode Horizontal)(Single-screen 1024x768 @ 85Hz)"),     /* mode 11 */
	_T("2400x600  @ 60Hz(1x3 Mode Horizontal)(Single-screen 800x600  @ 60Hz)"),     /* mode 12 */
	_T("2400x600  @ 75Hz(1x3 Mode Horizontal)(Single-screen 800x600  @ 75Hz)"),     /* mode 13 */
	_T("2400x600  @ 85Hz(1x3 Mode Horizontal)(Single-screen 800x600  @ 85Hz)"),     /* mode 14 */
	_T("2400x480  @ 60Hz(1x3 Mode Horizontal)(Single-screen 800x480  @ 60Hz)"),     /* mode 15 */
	_T("1920x480  @ 60Hz(1x3 Mode Horizontal)(Single-screen 640x480  @ 60Hz)"),     /* mode 16 */
	_T("1920x480  @ 75Hz(1x3 Mode Horizontal)(Single-screen 640x480  @ 75Hz)"),     /* mode 17 */
	_T("1920x480  @ 85Hz(1x3 Mode Horizontal)(Single-screen 640x480  @ 85Hz)"),     /* mode 18 */

	//两通道 1x2  Horizontal
	_T("3840x1200 @ 50Hz(1x2 Mode Horizontal)(Single-screen 1920x1200 @ 50Hz)"),     /* mode 33 */
	_T("3840x1080 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("3360x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("2880x900  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1440x900  @ 60Hz)"),     /* mode 38 */
	_T("2720x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("2560x1024 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 75Hz)"),     /* mode 44 */
	_T("2560x960  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("2560x720  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("2048x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 85Hz)"),     /* mode 57 */

	//三通道 3x1 垂直
	_T("1280x3072 @ 60Hz(3x1 Mode Vertical)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("1280x2880 @ 60Hz(3x1 Mode Vertical)(Single-screen 1280x960  @ 60Hz)"),     /* mode 2  */
	_T("1280x2400 @ 60Hz(3x1 Mode Vertical)(Single-screen 1280x800  @ 60Hz)"),     /* mode 4  */
	_T("1280x2304 @ 60Hz(3x1 Mode Vertical)(Single-screen 1280x768  @ 60Hz)"),     /* mode 5  */
	_T("1280x2160 @ 60Hz(3x1 Mode Vertical)(Single-screen 1280x720  @ 60Hz)"),     /* mode 7  */
	_T("1024x2304 @ 60Hz(3x1 Mode Vertical)(Single-screen 1024x768  @ 60Hz)"),     /* mode 9  */
	_T("1024x2304 @ 75Hz(3x1 Mode Vertical)(Single-screen 1024x768  @ 75Hz)"),     /* mode 10  */
	_T("1024x2304 @ 85Hz(3x1 Mode Vertical)(Single-screen 1024x768  @ 85Hz)"),     /* mode 11 */
	_T("800x1800  @ 60Hz(3x1 Mode Vertical)(Single-screen 800x600   @ 60Hz)"),     /* mode 12 */
	_T("800x1800  @ 75Hz(3x1 Mode Vertical)(Single-screen 800x600   @ 75Hz)"),     /* mode 13 */
	_T("800x1800  @ 85Hz(3x1 Mode Vertical)(Single-screen 800x600   @ 85Hz)"),     /* mode 14 */
	_T("800x1440  @ 60Hz(3x1 Mode Vertical)(Single-screen 800x480   @ 60Hz)"),     /* mode 15 */
	_T("640x1440  @ 60Hz(3x1 Mode Vertical)(Single-screen 640x480   @ 60Hz)"),     /* mode 16 */
	_T("640x1440  @ 75Hz(3x1 Mode Vertical)(Single-screen 640x480   @ 75Hz)"),     /* mode 17 */
	_T("640x1440  @ 85Hz(3x1 Mode Vertical)(Single-screen 640x480   @ 85Hz)"),     /* mode 18 */

	//两通道 2x1 垂直
	_T("1920x2400 @ 50Hz(2x1 Mode Vertical)(Single-screen 1920x1200 @ 50Hz)"),     /* mode 33 */
	_T("1920x2160 @ 60Hz(2x1 Mode Vertical)(Single-screen 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("1680x2100 @ 60Hz(2x1 Mode Vertical)(Single-screen 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("1440x1800 @ 60Hz(2x1 Mode Vertical)(Single-screen 1440x900  @ 60Hz)"),     /* mode 38 */
	_T("1360x1536 @ 60Hz(2x1 Mode Vertical)(Single-screen 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("1280x2048 @ 60Hz(2x1 Mode Vertical)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("1280x2048 @ 75Hz(2x1 Mode Vertical)(Single-screen 1280x1024 @ 75Hz)"),     /* mode 44 */
	_T("1280x1920 @ 60Hz(2x1 Mode Vertical)(Single-screen 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("1280x1600 @ 60Hz(2x1 Mode Vertical)(Single-screen 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("1280x1536 @ 60Hz(2x1 Mode Vertical)(Single-screen 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("1280x1440 @ 60Hz(2x1 Mode Vertical)(Single-screen 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("1024x1536 @ 60Hz(2x1 Mode Vertical)(Single-screen 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("1024x1536 @ 75Hz(2x1 Mode Vertical)(Single-screen 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("1024x1536 @ 85Hz(2x1 Mode Vertical)(Single-screen 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("800x1200  @ 60Hz(2x1 Mode Vertical)(Single-screen 800x600   @ 60Hz)"),     /* mode 55 */
	_T("800x1200  @ 75Hz(2x1 Mode Vertical)(Single-screen 800x600   @ 75Hz)"),     /* mode 56 */
	_T("800x1200  @ 85Hz(2x1 Mode Vertical)(Single-screen 800x600   @ 85Hz)"),     /* mode 57 */

	//单屏 1x1模式
	_T("800x600  @ 60Hz(1x1 Mode Single-screen)"),
	_T("1024x768 @ 60Hz(1x1 Mode Single-screen)"),
	_T("1280x720 @ 60Hz(1x1 Mode Single-screen)"),
	_T("1280x800 @ 60Hz(1x1 Mode Single-screen)"),
	_T("1280x960 @ 60Hz(1x1 Mode Single-screen)"),
	_T("1280x1024 @ 60Hz(1x1 Mode Single-screen)"),
	_T("1366x768  @ 60Hz(1x1 Mode Single-screen)"),
	_T("1400x1050 @ 60Hz(1x1 Mode Single-screen)"),
	_T("1440x900  @ 60Hz(1x1 Mode Single-screen)"),
	_T("1600x1200 @ 60Hz(1x1 Mode Single-screen)"),
	_T("1680x1050 @ 60Hz(1x1 Mode Single-screen)"),
	_T("1920x1080 @ 60Hz(1x1 Mode Single-screen)"),
	_T("1920x1200 @ 60Hz(1x1 Mode Single-screen)"),
	_T("3840x2160 @ 30Hz(1x1 Mode Single-screen)"),

	_T("END"),
};
//----------------------------------- END --------------------------------------------/
#endif


TIMING_STRUCT MVX303_HDMI_detailed_timings[TOTAL_MVX303_HDMI_TIMINGS] ={
	//Fpixel  h_active  h_blank  v_active  v_blank  h_front h_synct  v_front  v_synct h_size, v_size, h_pol, v_pol, h_border, v_border,  Hz
	//1x3 水平
	//  {25644, 4080,     1296,    768,      27,      192,    336,    3,        6,      4080,   768,    1,     1,     0,        0,       60}, // 总4080x768 (1x3 mode 水平)--单(1360x768  @ 60Hz)
	{26100, 3840,     240,     1024,     42,      48,     32,     1,        3,      3840,   1024,   1,     1,     0,        0,       60}, // 总3840x1024(1x3 mode 水平)--单(1280x1024 @ 60Hz)  - Flv
	{24000, 3840,     160,     960,      40,      48,     32,     1,        3,      3840,   960,    1,     1,     0,        0,       60}, // 总3840x960 (1x3 mode 水平)--单 1280x960  @ 60Hz  - Flv
	{25050, 3840,     1200,    800,      31,      216,    384,    3,        6,      3840,   800,    0,     1,     0,        0,       60}, // 总3840x800 (1x3 mode 水平)--单(1280x800  @ 60Hz)
	{20475, 3840,     480,     768,      22,      144,    96,     3,        7,      3840,   768,    1,     0,     0,        0,       60}, // 总3840x768 (1x3 mode 水平)--单(1280x768  @ 60Hz)
	{22300, 3840,     1116,    720,      30,      330,    120,    5,        5,      3840,   720,    1,     1,     0,        0,       60}, // 总3840x720 (1x3 mode 水平)--单(1280x720  @ 60Hz) - (DP)
	{19500, 3072,     960,     768,      38,      72,     408,    3,        6,      3072,   768,    0,     0,     0,        0,       60}, // 总3072x768 (1x3 mode 水平)--单(1024x768  @ 60Hz)
	{23625, 3072,     864,     768,      32,      48,     288,    1,        3,      3072,   768,    1,     1,     0,        0,       75}, // 总3072x768 (1x3 mode 水平)--单(1024x768  @ 75Hz)
	{28350, 3072,     1056,    768,      40,      192,    288,    1,        3,      3072,   768,    1,     1,     0,        0,       85}, // 总3072x768 (1x3 mode 水平)--单(1024x768  @ 85Hz)
	{12000, 2400,     768,     600,      28,      120,    384,    1,        4,      2400,   600,    1,     1,     0,        0,       60}, // 总2400x600 (1x3 mode 水平)--单(800x600   @ 60Hz)
	{14850, 2400,     768,     600,      25,      48,     240,    1,        3,      2400,   600,    1,     1,     0,        0,       75}, // 总2400x600 (1x3 mode 水平)--单(800x600   @ 75Hz)
	{16875, 2400,     744,     600,      31,      96,     192,    1,        3,      2400,   600,    1,     1,     0,        0,       85}, // 总2400x600 (1x3 mode 水平)--单(800x600   @ 85Hz)
	{10030, 2400,     768,     480,      45,      144,    384,    10,       2,      2400,   480,    0,     0,     0,        0,       60}, // 总2400x480 (1x3 mode 水平)--单(800x480   @ 60Hz)
	{7183,  1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       60}, // 总1920x480 (1x3 mode 水平)--单(640x480   @ 60Hz)
	{8979,  1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       75}, // 总1920x480 (1x3 mode 水平)--单(640x480   @ 75Hz)
	{10176, 1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       85}, // 总1920x480 (1x3 mode 水平)--单(640x480   @ 85Hz)

	//1x2水平 
	{25688, 3840,     320,     1200,     35,      96,     64,     3,        6,      3840,   1200,   1,     0,     0,        0,       50}, // 总3840x1200(1x2 mode 水平)--单(1920x1200 @ 50Hz)
	{29700, 3840,     560,     1080,     45,      176,    88,     4,        5,      3840,   1080,   1,     1,     0,        0,       60}, // 总3840x1080(1x2 mode 水平)--单(1920x1080 @ 60Hz)
	{23800, 3360,     320,     1050,     30,      96,     64,     3,        6,      3360,   1050,   1,     0,     0,        0,       60}, // 总3360x1050(1x2 mode 水平)--单(1680x1050 @ 60Hz)
	{17750, 2880,     320,     900,      26,      96,     64,     3,        6,      2880,   900,    1,     0,     0,        0,       60}, // 总2880x900 (1x2 mode 水平)--单(1440x900  @ 60Hz)
	{17100, 2720,     864,     768,      27,      128,    224,    3,        6,      2720,   768,    1,     1,     0,        0,       60}, // 总2720x768 (1x2 mode 水平)--单(1360x768  @ 60Hz)
	{21600, 2560,     816,     1024,     42,      96,     224,    1,        3,      2560,   1024,   1,     1,     0,        0,       60}, // 总2560x1024(1x2 mode 水平)--单(1280x1024 @ 60Hz)
	{27000, 2560,     816,     1024,     42,      32,     288,    1,        3,      2560,   1024,   1,     1,     0,        0,       60}, // 总2560x1024(1x2 mode 水平)--单(1280x1024 @ 60Hz)
	{21600, 2560,     1040,    960,      40,      192,    224,    1,        3,      2560,   960,    1,     1,     0,        0,       60}, // 总2560x960 (1x2 mode 水平)--单(1280x960  @ 60Hz)
	{16700, 2560,     800,     800,      31,      144,    256,    3,        6,      2560,   800,    0,     1,     0,        0,       60}, // 总2560x800 (1x2 mode 水平)--单(1280x800  @ 60Hz)
	{13650, 2560,     320,     768,      22,      96,     64,     3,        7,      2560,   768,    1,     0,     0,        0,       60}, // 总2560x768 (1x2 mode 水平)--单(1280x768  @ 60Hz)
	{14850, 2560,     740,     720,      30,      220,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       60}, // 总2560x720 (1x2 mode 水平)--单(1280x720  @ 60Hz)
	{13000, 2048,     640,     768,      38,      48,     272,    3,        6,      2048,   768,    0,     0,     0,        0,       60}, // 总2048x768 (1x2 mode 水平)--单(1024x768  @ 60Hz)
	{15750, 2048,     576,     768,      32,      32,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       75}, // 总2048x768 (1x2 mode 水平)--单(1024x768  @ 75Hz)
	{18900, 2048,     704,     768,      40,      96,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       85}, // 总2048x768 (1x2 mode 水平)--单(1024x768  @ 85Hz)
	{8000,  1600,     512,     600,      28,      80,     256,    1,        4,      1600,   600,    1,     1,     0,        0,       60}, // 总1600x600 (1x2 mode 水平)--单(800x600   @ 60Hz)
	{9900,  1600,     512,     600,      25,      32,     160,    1,        3,      1600,   600,    1,     1,     0,        0,       75}, // 总1600x600 (1x2 mode 水平)--单(800x600   @ 75Hz)
	{11250, 1600,     496,     600,      31,      64,     128,    1,        3,      1600,   600,    1,     1,     0,        0,       85}, // 总1600x600 (1x2 mode 水平)--单(800x600   @ 85Hz)

	//3x1垂直 
	{27630, 1280,     160,     3072,     126,     48,     32,     3,        9,      1280,   3072,   1,     1,     0,        0,       60}, // 总1280x3072(3x1 mode 垂直)--单(1280x1024 @ 60Hz) - Flv
	{25920, 1280,     160,     2880,     120,     48,     32,     3,        9,      1280,   2880,   1,     1,     0,        0,       60}, // 总1280x2880(3x1 mode 垂直)--单(1280x960  @ 60Hz) - Flv   
	{25050, 1280,     400,     2400,     93,      72,     128,    9,        18,     1280,   2400,   0,     1,     0,        0,       60}, // 总1280x2400(3x1 mode 垂直)--单(1280x800  @ 60Hz)
	{23850, 1280,     384,     2304,     90,      64,     128,    9,        21,     1280,   2304,   1,     0,     0,        0,       60}, // 总1280x2304(3x1 mode 垂直)--单(1280x768  @ 60Hz)
	{22300, 1280,     372,     2160,     90,      110,    40,     15,       15,     1280,   2160,   1,     1,     0,        0,       60}, // 总1280x2160(3x1 mode 垂直)--单(1280x720  @ 60Hz)(DP)
	{19500, 1024,     320,     2304,     114,     24,     136,    9,        18,     1024,   2304,   0,     0,     0,        0,       60}, // 总1024x2304(3x1 mode 垂直)--单(1024x768  @ 60Hz)
	{23625, 1024,     288,     2304,     96,      24,     96,     3,        9,      1024,   2304,   1,     1,     0,        0,       75}, // 总1024x2304(3x1 mode 垂直)--单(1024x768  @ 75Hz)
	{28350, 1024,     352,     2304,     120,     64,     96,     3,        9,      1024,   2304,   1,     1,     0,        0,       85}, // 总1024x2304(3x1 mode 垂直)--单(1024x768  @ 85Hz)                                                                               
	{12000, 800,      256,     1800,     84,      40,     128,    3,        12,     800,    1800,   1,     1,     0,        0,       60}, // 总800x1800 (3x1 mode 垂直)--单(800x600   @ 60Hz)
	{14850, 800,      256,     1800,     75,      16,     80,     3,        9,      800,    1800,   1,     1,     0,        0,       75}, // 总800x1800 (3x1 mode 垂直)--单(800x600   @ 75Hz)
	{16875, 800,      248,     1800,     93,      32,     64,     3,        9,      800,    1800,   1,     1,     0,        0,       85}, // 总800x1800 (3x1 mode 垂直)--单(800x600   @ 85Hz)
	{10030, 800,      256,     1440,     135,     48,     128,    30,       6,      800,    1440,   0,     0,     0,        0,       60}, // 总800x1440 (3x1 mode 垂直)--单(800x480   @ 60Hz) 
	{7183,  640,      144,     1440,     87,      8,      96,     6,        2,      640,    1440,   0,     0,     0,        0,       60}, // 总640x1440 (3x1 mode 垂直)--单(640x480   @ 60Hz)
	{8979,  640,      144,     1440,     87,      8,      96,     6,        2,      640,    1440,   0,     0,     0,        0,       75}, // 总640x1440 (3x1 mode 垂直)--单(640x480   @ 75Hz)
	{10176, 640,      144,     1440,     87,      8,      96,     6,        2,      640,    1440,   0,     0,     0,        0,       85}, // 总640x1440 (3x1 mode 垂直)--单(640x480   @ 85Hz)   

	//2x1 垂直 
	{25688, 1920,     160,     2400,     70,      48,     32,     6,        12,     1920,   2400,   1,     0,     0,        0,       50}, // 总1920x2400(2x1 mode 垂直)--单(1920x1200 @ 50Hz)    
	{28080, 1920,     160,     2160,     90,      48,     32,     8,        10,     1920,   2160,   1,     1,     0,        0,       60}, // 总1920x2160(2x1 mode 垂直)--单(1920x1080 @ 60Hz)   
	{29250, 1680,     560,     2100,     78,      104,    176,    6,        12,     1680,   100,    1,     0,     0,        0,       60}, // 总1680x2100(2x1 mode 垂直)--单(1680x1050 @ 60Hz) 
	{21300, 1440,     464,     1800,     68,      80,     152,    6,        12,     1440,   1800,   1,     0,     0,        0,       60}, // 总1440x1800(2x1 mode 垂直)--单(1440x900  @ 60Hz)
	{17100, 1360,     432,     1536,     54,      64,     112,    6,        6,      1360,   1536,   1,     1,     0,        0,       60}, // 总1360x1536(2x1 mode 垂直)--单(1360x768  @ 60Hz)
	{21600, 1280,     408,     2048,     84,      48,     112,    2,        6,      1280,   2048,   1,     1,     0,        0,       60}, // 总1280x2048(2x1 mode 垂直)--单(1280x1024 @ 60Hz)
	{26991, 1280,     408,     2048,     84,      16,     114,    2,        6,      1280,   2048,   1,     1,     0,        0,       75}, // 总1280x2048(2x1 mode 垂直)--单(1280x1024 @ 75Hz)
	{21600, 1280,     520,     1920,     80,      96,     112,    2,        6,      1280,   1920,   1,     1,     0,        0,       60}, // 总1280x1920(2x1 mode 垂直)--单(1280x960  @ 60Hz) 
	{16700, 1280,     400,     1600,     46,      72,     128,    6,        12,     1280,   1600,   0,     1,     0,        0,       60}, // 总1280x1600(2x1 mode 垂直)--单(1280x800  @ 60Hz)                                                                                                             
	{13651, 1280,     160,     1536,     44,      48,     32,     6,        14,     1280,   1536,   1,     0,     0,        0,       60}, // 总1280x1536(2x1 mode 垂直)--单(1280x768  @ 60Hz REDUCED)
	{14850, 1280,     370,     1440,     60,      110,    40,     10,       10,     1280,   1440,   1,     1,     0,        0,       60}, // 总1280x1440(2x1 mode 垂直)--单(1280x720  @ 60Hz) 
	{13000, 1024,     320,     1536,     76,      24,     136,    6,        12,     1024,   1536,   0,     0,     0,        0,       60}, // 总1024x1536(2x1 mode 垂直)--单(1024x768  @ 60Hz) 
	{15750, 1024,     288,     1536,     64,      16,     96,     2,        6,      1024,   1536,   1,     1,     0,        0,       75}, // 总1024x1536(2x1 mode 垂直)--单(1024x768  @ 75Hz)  
	{18900, 1024,     352,     1536,     80,      48,     96,     2,        6,      1024,   1536,   1,     1,     0,        0,       85}, // 总1024x1536(2x1 mode 垂直)--单(1024x768  @ 85Hz)	
	{8000,  800,      256,     1200,     56,      40,     128,    2,        8,      800,    1200,   1,     1,     0,        0,       60}, // 总800x1200 (2x1 mode 垂直)--单(800x600   @ 60Hz)
	{9900,  800,      256,     1200,     50,      16,     80,     2,        6,      800,    1200,   1,     1,     0,        0,       75}, // 总800x1200 (2x1 mode 垂直)--单(800x600   @ 75Hz) 
	{11250, 800,      248,     1200,     62,      32,     64,     2,        6,      800,    1200,   1,     1,     0,        0,       85}, // 总800x1200 (2x1 mode 垂直)--单(800x600   @ 85Hz) 

	//1x1单屏
	{4000,  800,      256,     600,      28,      40,     128,    1,        4,      1056,   628,    1,	   1,     0,        0,       60},		//800*600 @ 60HZ
	{6500,  1024,     320,     768,      38,      24,     136,    3,        6,      1344,   806,    0,	   0,     0,        0,       60},	    //1024*768 @ 60HZ
	{7425,  1280,     370,     720,      30,      110,    40,     5,        5,      1650,   750,    1,	   1,     0,        0,       60},	    //1280*720 @ 60HZ
	{8376,  1280,     400,     800,		 31,      72,     128,    3,        6,      1680,   831,    0,	   1,     0,        0,       60},	    //1280*800 @ 60HZ
	{10800, 1280,     520,     960,      40,      96,     112,    1,        3,      1800,   1000,   1,	   1,     0,        0,       60},     //1280*960 @ 60Hz
	{10796, 1280,     408,     1024,     42,      48,     112,    1,        3,      1688,   1066,   1,	   1,     0,        0,       60},	    //1280*1024 @ 60HZ
	{7200,  1366,     134,     768,      32,      14,     56,     1,        3,      1500,   800,    1,	   1,     0,        0,       60},		//1366*768 @ 60Hz
	{10100, 1400,     160,     1050,     30,      48,     32,     3,        4,      1560,   1080,   1,	   0,     0,        0,       60},		//1400*1050 @ 60HZ
	{10670, 1440,     464,     900,      34,      80,     152,    3,        6,      1904,   934,    1,	   0,     0,        0,       60},	    //1440x900  @ 60Hz
	{16200, 1600,     560,     1200,     50,      64,     192,    1,        3,      2160,   1250,   1,	   1,     0,        0,       60},		//1600x1200 @ 60Hz
	{14636, 1680,     560,     1050,     39,      104,    176,    3,        6,      2240,   1089,   1,	   0,     0,        0,       60},		//1680x1050 @ 60Hz
	{14850, 1920,     280,     1080,     45,      88,     44,     4,        5,      2200,   1125,   1,	   1,     0,        0,       60},     //1920*1080 @ 60HZ
	{15412, 1920,     160,     1200,     35,      48,     32,     3,        6,      2080,   1235,   1,	   0,     0,        0,       60},	    //1920*1200 @ 60HZ
	{29700, 3840,     560,     2160,     90,      176,    88,     8,        10,     4400,   2250,   1,	   1,     0,        0,       30}      //3840*2160 @ 30Hz
};
//----------------------------------- END --------------------------------------------/
