#ifndef __MVTIMINGS_H__
#define __MVTIMINGS_H__

/***************************** MV103_HDMI ********************************************/
//
//- 以下为 MV103_HDMI    支持小于297M，且非宽屏的所有分辨率 
//- 支持50Hz,60Hz,75Hz,85Hz等 ， 以及支持部分Flexview的分辨率， 且仅支持1x2,1x3,1x1水平分割模式，以及3x1,2x1等垂直模式  
//-----------------------------------<<< 中文版 >>>-----------------------------------------------------------
#define TOTAL_MV103_HDMI_TIMINGS 74
#ifndef ENGLISHVER
CString m_MV103_HDMI_strTimings[] = {
	//三通道  1x3 水平
	//_T("4080x768  @ 60Hz(1x3 Mode 水平)(单屏 1360x768 @ 60Hz)"),   /* mode 19 */
	_T("3840x1024 @ 60Hz(1x3 Mode 水平)(单屏 1280x1024 @ 60Hz)"),    /* mode 1  */ 
	_T("3840x960  @ 60Hz(1x3 Mode 水平)(单屏 1280x960 @ 60Hz)"),     /* mode 2  */
	_T("3840x800  @ 60Hz(1x3 Mode 水平)(单屏 1280x800 @ 60Hz)"),     /* mode 4  */
	_T("3840x768  @ 60Hz(1x3 Mode 水平)(单屏 1280x768 @ 60Hz)"),     /* mode 5  */
	_T("3840x720  @ 60Hz(1x3 Mode 水平)(单屏 1280x720 @ 60Hz)"),     /* mode 7  */
	_T("3072x768  @ 60Hz(1x3 Mode 水平)(单屏 1024x768 @ 60Hz)"),     /* mode 9  */
	_T("3072x768  @ 75Hz(1x3 Mode 水平)(单屏 1024x768 @ 75Hz)"),     /* mode 10  */
	_T("3072x768  @ 85Hz(1x3 Mode 水平)(单屏 1024x768 @ 85Hz)"),     /* mode 11 */
	_T("2400x600  @ 60Hz(1x3 Mode 水平)(单屏 800x600  @ 60Hz)"),     /* mode 12 */
	_T("2400x600  @ 75Hz(1x3 Mode 水平)(单屏 800x600  @ 75Hz)"),     /* mode 13 */
	_T("2400x600  @ 85Hz(1x3 Mode 水平)(单屏 800x600  @ 85Hz)"),     /* mode 14 */
	_T("2400x480  @ 60Hz(1x3 Mode 水平)(单屏 800x480  @ 60Hz)"),     /* mode 15 */
	_T("1920x480  @ 60Hz(1x3 Mode 水平)(单屏 640x480  @ 60Hz)"),     /* mode 16 */
	_T("1920x480  @ 75Hz(1x3 Mode 水平)(单屏 640x480  @ 75Hz)"),     /* mode 17 */
	_T("1920x480  @ 85Hz(1x3 Mode 水平)(单屏 640x480  @ 85Hz)"),     /* mode 18 */

	//两通道 1x2  水平
	_T("3840x1200 @ 50Hz(1x2 Mode 水平)(单屏 1920x1200 @ 50Hz)"),     /* mode 33 */
	_T("3840x1080 @ 60Hz(1x2 Mode 水平)(单屏 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("3360x1050 @ 60Hz(1x2 Mode 水平)(单屏 1680x1050 @ 60Hz)"),     /* mode 36 */
	//_T("3200x1200 @ 60Hz(1x2 Mode 水平)(单屏 1600x1200 @ 60Hz)"),	  /* mode 37 */
	_T("2880x900  @ 60Hz(1x2 Mode 水平)(单屏 1440x900  @ 60Hz)"),     /* mode 38 */
	//_T("2800x1050 @ 60Hz(1x2 Mode 水平)(单屏 1400x1050 @ 60Hz)"),   /* mode 40 */
	//_T("2732x768  @ 60Hz(1x2 Mode 水平)(单屏 1366x768 @ 60Hz)"),    /* mode 41 */
	_T("2720x768  @ 60Hz(1x2 Mode 水平)(单屏 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("2560x1024 @ 60Hz(1x2 Mode 水平)(单屏 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode 水平)(单屏 1280x1024 @ 75Hz)"),     /* mode 44 */
	//_T("2560x1024 @ 85Hz(1x2 Mode 水平)(单屏 1280x1024 @ 85Hz)"),   /* mode 45 */
	_T("2560x960  @ 60Hz(1x2 Mode 水平)(单屏 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode 水平)(单屏 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode 水平)(单屏 1280x768  @ 60Hz)"),     /* mode 48 */
	//_T("2560x720  @ 50Hz(1x2 Mode 水平)(单屏 1280x720 @ 50Hz)"),    /* mode 49 */
	_T("2560x720  @ 60Hz(1x2 Mode 水平)(单屏 1280x720  @ 60Hz)"),     /* mode 50 */
	//_T("2048x768  @ 50Hz(1x2 Mode 水平)(单屏 1024x768 @ 50Hz)"),    /* mode 51 */
	_T("2048x768  @ 60Hz(1x2 Mode 水平)(单屏 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode 水平)(单屏 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode 水平)(单屏 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode 水平)(单屏 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode 水平)(单屏 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode 水平)(单屏 800x600   @ 85Hz)"),     /* mode 57 */

	//三通道 3x1 垂直
	_T("总 1680x3150 @ 60Hz(3x1 Mode 垂直)(单屏 1680x1050 @ 50Hz)"),  //Wide
	_T("总 1600x3600 @ 60Hz(3x1 Mode 垂直)(单屏 1600x1200 @ 50Hz)"),  //Wide
	_T("总 1600x2700 @ 60Hz(3x1 Mode 垂直)(单屏 1600x900  @ 60Hz)"),  //Wide
	_T("总 1440x2700 @ 60Hz(3x1 Mode 垂直)(单屏 1440x900  @ 60Hz)"),  //Wide
	_T("总 1400x3150 @ 60Hz(3x1 Mode 垂直)(单屏 1400x1050 @ 60Hz)"),  //Wide
	_T("总 1366x2304 @ 60Hz(3x1 Mode 垂直)(单屏 1366x768  @ 60Hz)"),  //Wide

	_T("1360x2304 @ 60Hz(3x1 Mode 垂直)(单屏 1360x768 @ 60Hz)"),     /* mode 19 */
	_T("1280x3072 @ 60Hz(3x1 Mode 垂直)(单屏 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("1280x2880 @ 60Hz(3x1 Mode 垂直)(单屏 1280x960  @ 60Hz)"),     /* mode 2  */
	_T("1280x2400 @ 60Hz(3x1 Mode 垂直)(单屏 1280x800  @ 60Hz)"),     /* mode 4  */
	_T("1280x2304 @ 60Hz(3x1 Mode 垂直)(单屏 1280x768  @ 60Hz)"),     /* mode 5  */
	_T("1280x2160 @ 60Hz(3x1 Mode 垂直)(单屏 1280x720  @ 60Hz)"),     /* mode 7  */
	_T("1024x2304 @ 60Hz(3x1 Mode 垂直)(单屏 1024x768  @ 60Hz)"),     /* mode 9  */
	_T("1024x2304 @ 75Hz(3x1 Mode 垂直)(单屏 1024x768  @ 75Hz)"),     /* mode 10  */
	_T("1024x2304 @ 85Hz(3x1 Mode 垂直)(单屏 1024x768  @ 85Hz)"),     /* mode 11 */
	_T("800x1800  @ 60Hz(3x1 Mode 垂直)(单屏 800x600   @ 60Hz)"),     /* mode 12 */
	_T("800x1800  @ 75Hz(3x1 Mode 垂直)(单屏 800x600   @ 75Hz)"),     /* mode 13 */
	_T("800x1800  @ 85Hz(3x1 Mode 垂直)(单屏 800x600   @ 85Hz)"),     /* mode 14 */
	_T("800x1440  @ 60Hz(3x1 Mode 垂直)(单屏 800x480   @ 60Hz)"),     /* mode 15 */
	_T("640x1440  @ 60Hz(3x1 Mode 垂直)(单屏 640x480   @ 60Hz)"),     /* mode 16 */
	_T("640x1440  @ 75Hz(3x1 Mode 垂直)(单屏 640x480   @ 75Hz)"),     /* mode 17 */
	_T("640x1440  @ 85Hz(3x1 Mode 垂直)(单屏 640x480   @ 85Hz)"),     /* mode 18 */

	//两通道 2x1 垂直
	_T("1920x2400 @ 50Hz(2x1 Mode 垂直)(单屏 1920x1200 @ 50Hz)"),     /* mode 33 */
	_T("1920x2160 @ 60Hz(2x1 Mode 垂直)(单屏 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("1680x2100 @ 60Hz(2x1 Mode 垂直)(单屏 1680x1050 @ 60Hz)"),     /* mode 36 */
	//_T("1600x2400 @ 50Hz(2x1 Mode 垂直)(单屏 1600x1200 @ 5Hz)"),	  /* mode 37 */
	//_T("1600x1800 @ 60Hz(2x1 Mode 垂直)(单屏 1600x900 @ 60Hz)"),
	_T("1440x1800 @ 60Hz(2x1 Mode 垂直)(单屏 1440x900  @ 60Hz)"),     /* mode 38 */
	//_T("1400x2100 @ 60Hz(2x1 Mode 垂直)(单屏 1400x1050 @ 60Hz)"),     /* mode 40 */
	//_T("1366x1536 @ 60Hz(2x1 Mode 垂直)(单屏 1366x768 @ 60Hz)"),     /* mode 41 */
	_T("1360x1536 @ 60Hz(2x1 Mode 垂直)(单屏 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("1280x2048 @ 60Hz(2x1 Mode 垂直)(单屏 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("1280x2048 @ 75Hz(2x1 Mode 垂直)(单屏 1280x1024 @ 75Hz)"),     /* mode 44 */
	//_T("1280x2048 @ 85Hz(2x1 Mode 垂直)(单屏 1280x1024 @ 85Hz)"),     /* mode 45 */
	_T("1280x1920 @ 60Hz(2x1 Mode 垂直)(单屏 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("1280x1600 @ 60Hz(2x1 Mode 垂直)(单屏 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("1280x1536 @ 60Hz(2x1 Mode 垂直)(单屏 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("1280x1440 @ 60Hz(2x1 Mode 垂直)(单屏 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("1024x1536 @ 60Hz(2x1 Mode 垂直)(单屏 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("1024x1536 @ 75Hz(2x1 Mode 垂直)(单屏 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("1024x1536 @ 85Hz(2x1 Mode 垂直)(单屏 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("800x1200  @ 60Hz(2x1 Mode 垂直)(单屏 800x600   @ 60Hz)"),     /* mode 55 */
	_T("800x1200  @ 75Hz(2x1 Mode 垂直)(单屏 800x600   @ 75Hz)"),     /* mode 56 */
	_T("800x1200  @ 85Hz(2x1 Mode 垂直)(单屏 800x600   @ 85Hz)"),     /* mode 57 */

	//单屏 1x1模式
	_T("1920x1200 @ 60Hz(1x1 Mode 单屏)"),	      /* mode 58*/
	_T("1920x1080 @ 60Hz(1x1 Mode 单屏)"),	      /* mode 59*/
	_T("1600x1200 @ 60Hz(1x1 Mode 单屏)"),       /* mode 60*/

	_T("END"),
};
//-----------------------------------<<<  英文版 >>>----------------------------------------------------------
#else
CString m_MV103_HDMI_strTimings[] = {
	//三通道  1x3 Horizontal
	//_T("4080x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1360x768 @ 60Hz)"),     /* mode 19 */
	_T("3840x1024 @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("3840x960  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x960 @ 60Hz)"),     /* mode 2  */
	_T("3840x800  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x800 @ 60Hz)"),     /* mode 4  */
	_T("3840x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x768 @ 60Hz)"),     /* mode 5  */
	_T("3840x720  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x720 @ 60Hz)"),     /* mode 7  */
	_T("3072x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1024x768 @ 60Hz)"),     /* mode 9  */
	_T("3072x768  @ 75Hz(1x3 Mode Horizontal)(Single-screen 1024x768 @ 75Hz)"),     /* mode 10  */
	_T("3072x768  @ 85Hz(1x3 Mode Horizontal)(Single-screen 1024x768 @ 85Hz)"),     /* mode 11 */
	_T("2400x600  @ 60Hz(1x3 Mode Horizontal)(Single-screen 800x600  @ 60Hz)"),     /* mode 12 */
	_T("2400x600  @ 75Hz(1x3 Mode Horizontal)(Single-screen 800x600  @ 75Hz)"),     /* mode 13 */
	_T("2400x600  @ 85Hz(1x3 Mode Horizontal)(Single-screen 800x600  @ 85Hz)"),     /* mode 14 */
	_T("2400x480  @ 60Hz(1x3 Mode Horizontal)(Single-screen 800x480  @ 60Hz)"),     /* mode 15 */
	_T("1920x480  @ 60Hz(1x3 Mode Horizontal)(Single-screen 640x480  @ 60Hz)"),     /* mode 16 */
	_T("1920x480  @ 75Hz(1x3 Mode Horizontal)(Single-screen 640x480  @ 75Hz)"),     /* mode 17 */
	_T("1920x480  @ 85Hz(1x3 Mode Horizontal)(Single-screen 640x480  @ 85Hz)"),     /* mode 18 */

	//两通道 1x2  Horizontal
	_T("3840x1200 @ 50Hz(1x2 Mode Horizontal)(Single-screen 1920x1200 @ 50Hz)"),     /* mode 33 */
	_T("3840x1080 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("3360x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1680x1050 @ 60Hz)"),     /* mode 36 */
	//_T("3200x1200 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1600x1200 @ 60Hz)"),	  /* mode 37 */
	_T("2880x900  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1440x900  @ 60Hz)"),     /* mode 38 */
	//_T("2800x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1400x1050 @ 60Hz)"),     /* mode 40 */
	//_T("2732x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1366x768 @ 60Hz)"),     /* mode 41 */
	_T("2720x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("2560x1024 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 75Hz)"),     /* mode 44 */
	//_T("2560x1024 @ 85Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 85Hz)"),     /* mode 45 */
	_T("2560x960  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x768  @ 60Hz)"),     /* mode 48 */
	//_T("2560x720  @ 50Hz(1x2 Mode Horizontal)(Single-screen 1280x720 @ 50Hz)"),     /* mode 49 */
	_T("2560x720  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x720  @ 60Hz)"),     /* mode 50 */
	//_T("2048x768  @ 50Hz(1x2 Mode Horizontal)(Single-screen 1024x768 @ 50Hz)"),     /* mode 51 */
	_T("2048x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 85Hz)"),     /* mode 57 */

	//三通道 3x1 垂直
	_T("1680x3150 @ 60Hz(3x1 Mode Vertical)(Single-screen 1680x1050 @ 50Hz)"),
	_T("1600x3600 @ 60Hz(3x1 Mode Vertical)(Single-screen 1600x1200 @ 50Hz)"),
	_T("1600x2700 @ 60Hz(3x1 Mode Vertical)(Single-screen 1600x900  @ 60Hz)"),
	_T("1440x2700 @ 60Hz(3x1 Mode Vertical)(Single-screen 1440x900  @ 60Hz)"),
	_T("1400x3150 @ 60Hz(3x1 Mode Vertical)(Single-screen 1400x1050 @ 60Hz)"),
	_T("1366x2304 @ 60Hz(3x1 Mode Vertical)(Single-screen 1366x768  @ 60Hz)"),
	_T("1360x2304 @ 60Hz(3x1 Mode Vertical)(Single-screen 1360x768 @ 60Hz)"),     /* mode 19 */
	_T("1280x3072 @ 60Hz(3x1 Mode Vertical)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("1280x2880 @ 60Hz(3x1 Mode Vertical)(Single-screen 1280x960  @ 60Hz)"),     /* mode 2  */
	_T("1280x2400 @ 60Hz(3x1 Mode Vertical)(Single-screen 1280x800  @ 60Hz)"),     /* mode 4  */
	_T("1280x2304 @ 60Hz(3x1 Mode Vertical)(Single-screen 1280x768  @ 60Hz)"),     /* mode 5  */
	_T("1280x2160 @ 60Hz(3x1 Mode Vertical)(Single-screen 1280x720  @ 60Hz)"),     /* mode 7  */
	_T("1024x2304 @ 60Hz(3x1 Mode Vertical)(Single-screen 1024x768  @ 60Hz)"),     /* mode 9  */
	_T("1024x2304 @ 75Hz(3x1 Mode Vertical)(Single-screen 1024x768  @ 75Hz)"),     /* mode 10  */
	_T("1024x2304 @ 85Hz(3x1 Mode Vertical)(Single-screen 1024x768  @ 85Hz)"),     /* mode 11 */
	_T("800x1800  @ 60Hz(3x1 Mode Vertical)(Single-screen 800x600   @ 60Hz)"),     /* mode 12 */
	_T("800x1800  @ 75Hz(3x1 Mode Vertical)(Single-screen 800x600   @ 75Hz)"),     /* mode 13 */
	_T("800x1800  @ 85Hz(3x1 Mode Vertical)(Single-screen 800x600   @ 85Hz)"),     /* mode 14 */
	_T("800x1440  @ 60Hz(3x1 Mode Vertical)(Single-screen 800x480   @ 60Hz)"),     /* mode 15 */
	_T("640x1440  @ 60Hz(3x1 Mode Vertical)(Single-screen 640x480   @ 60Hz)"),     /* mode 16 */
	_T("640x1440  @ 75Hz(3x1 Mode Vertical)(Single-screen 640x480   @ 75Hz)"),     /* mode 17 */
	_T("640x1440  @ 85Hz(3x1 Mode Vertical)(Single-screen 640x480   @ 85Hz)"),     /* mode 18 */

	//两通道 2x1 垂直
	_T("1920x2400 @ 50Hz(2x1 Mode Vertical)(Single-screen 1920x1200 @ 50Hz)"),     /* mode 33 */
	_T("1920x2160 @ 60Hz(2x1 Mode Vertical)(Single-screen 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("1680x2100 @ 60Hz(2x1 Mode Vertical)(Single-screen 1680x1050 @ 60Hz)"),     /* mode 36 */
	//_T("1600x2400 @ 50Hz(2x1 Mode Vertical)(Single-screen 1600x1200 @ 5Hz)"),	  /* mode 37 */
	//_T("1600x1800 @ 60Hz(2x1 Mode Vertical)(Single-screen 1600x900 @ 60Hz)"),
	_T("1440x1800 @ 60Hz(2x1 Mode Vertical)(Single-screen 1440x900  @ 60Hz)"),     /* mode 38 */
	//_T("1400x2100 @ 60Hz(2x1 Mode Vertical)(Single-screen 1400x1050 @ 60Hz)"),     /* mode 40 */
	//_T("1366x1536 @ 60Hz(2x1 Mode Vertical)(Single-screen 1366x768 @ 60Hz)"),     /* mode 41 */
	_T("1360x1536 @ 60Hz(2x1 Mode Vertical)(Single-screen 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("1280x2048 @ 60Hz(2x1 Mode Vertical)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("1280x2048 @ 75Hz(2x1 Mode Vertical)(Single-screen 1280x1024 @ 75Hz)"),     /* mode 44 */
	//_T("1280x2048 @ 85Hz(2x1 Mode Vertical)(Single-screen 1280x1024 @ 85Hz)"),     /* mode 45 */
	_T("1280x1920 @ 60Hz(2x1 Mode Vertical)(Single-screen 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("1280x1600 @ 60Hz(2x1 Mode Vertical)(Single-screen 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("1280x1536 @ 60Hz(2x1 Mode Vertical)(Single-screen 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("1280x1440 @ 60Hz(2x1 Mode Vertical)(Single-screen 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("1024x1536 @ 60Hz(2x1 Mode Vertical)(Single-screen 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("1024x1536 @ 75Hz(2x1 Mode Vertical)(Single-screen 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("1024x1536 @ 85Hz(2x1 Mode Vertical)(Single-screen 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("800x1200  @ 60Hz(2x1 Mode Vertical)(Single-screen 800x600   @ 60Hz)"),     /* mode 55 */
	_T("800x1200  @ 75Hz(2x1 Mode Vertical)(Single-screen 800x600   @ 75Hz)"),     /* mode 56 */
	_T("800x1200  @ 85Hz(2x1 Mode Vertical)(Single-screen 800x600   @ 85Hz)"),     /* mode 57 */

	//单屏 1x1模式
	_T("1920x1200 @ 60Hz(1x1 Mode Single-screen)"),	      /* mode 58*/
	_T("1920x1080 @ 60Hz(1x1 Mode Single-screen)"),	      /* mode 59*/
	_T("1600x1200 @ 60Hz(1x1 Mode Single-screen)"),       /* mode 60*/

	_T("END"),
};
//----------------------------------- END --------------------------------------------/
#endif


TIMING_STRUCT MV103_HDMI_detailed_timings[TOTAL_MV103_HDMI_TIMINGS] ={
	//Fpixel  h_active  h_blank  v_active  v_blank  h_front h_synct  v_front  v_synct h_size, v_size, h_pol, v_pol, h_border, v_border,  Hz
	//1x3 水平
	//  {25644, 4080,     1296,    768,      27,      192,    336,    3,        6,      4080,   768,    1,     1,     0,        0,       60}, // 总4080x768 (1x3 mode 水平)--单(1360x768  @ 60Hz)
	{26100, 3840,     240,     1024,     42,      48,     32,     1,        3,      3840,   1024,   1,     1,     0,        0,       60}, // 总3840x1024(1x3 mode 水平)--单(1280x1024 @ 60Hz)  - Flv
	{24000, 3840,     160,     960,      40,      48,     32,     1,        3,      3840,   960,    1,     1,     0,        0,       60}, // 总3840x960 (1x3 mode 水平)--单 1280x960  @ 60Hz  - Flv
	{25050, 3840,     1200,    800,      31,      216,    384,    3,        6,      3840,   800,    0,     1,     0,        0,       60}, // 总3840x800 (1x3 mode 水平)--单(1280x800  @ 60Hz)
	{20475, 3840,     480,     768,      22,      144,    96,     3,        7,      3840,   768,    1,     0,     0,        0,       60}, // 总3840x768 (1x3 mode 水平)--单(1280x768  @ 60Hz)
	{22300, 3840,     1116,    720,      30,      330,    120,    5,        5,      3840,   720,    1,     1,     0,        0,       60}, // 总3840x720 (1x3 mode 水平)--单(1280x720  @ 60Hz) - (DP)
	{19500, 3072,     960,     768,      38,      72,     408,    3,        6,      3072,   768,    0,     0,     0,        0,       60}, // 总3072x768 (1x3 mode 水平)--单(1024x768  @ 60Hz)
	{23625, 3072,     864,     768,      32,      48,     288,    1,        3,      3072,   768,    1,     1,     0,        0,       75}, // 总3072x768 (1x3 mode 水平)--单(1024x768  @ 75Hz)
	{28350, 3072,     1056,    768,      40,      192,    288,    1,        3,      3072,   768,    1,     1,     0,        0,       85}, // 总3072x768 (1x3 mode 水平)--单(1024x768  @ 85Hz)
	{12000, 2400,     768,     600,      28,      120,    384,    1,        4,      2400,   600,    1,     1,     0,        0,       60}, // 总2400x600 (1x3 mode 水平)--单(800x600   @ 60Hz)
	{14850, 2400,     768,     600,      25,      48,     240,    1,        3,      2400,   600,    1,     1,     0,        0,       75}, // 总2400x600 (1x3 mode 水平)--单(800x600   @ 75Hz)
	{16875, 2400,     744,     600,      31,      96,     192,    1,        3,      2400,   600,    1,     1,     0,        0,       85}, // 总2400x600 (1x3 mode 水平)--单(800x600   @ 85Hz)
	{10030, 2400,     768,     480,      45,      144,    384,    10,       2,      2400,   480,    0,     0,     0,        0,       60}, // 总2400x480 (1x3 mode 水平)--单(800x480   @ 60Hz)
	{7183,  1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       60}, // 总1920x480 (1x3 mode 水平)--单(640x480   @ 60Hz)
	{8979,  1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       75}, // 总1920x480 (1x3 mode 水平)--单(640x480   @ 75Hz)
	{10176, 1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       85}, // 总1920x480 (1x3 mode 水平)--单(640x480   @ 85Hz)

	//1x2水平 
	{25688, 3840,     320,     1200,     35,      96,     64,     3,        6,      3840,   1200,   1,     0,     0,        0,       50}, // 总3840x1200(1x2 mode 水平)--单(1920x1200 @ 50Hz)
	{29700, 3840,     560,     1080,     45,      176,    88,     4,        5,      3840,   1080,   1,     1,     0,        0,       60}, // 总3840x1080(1x2 mode 水平)--单(1920x1080 @ 60Hz)
	{23800, 3360,     320,     1050,     30,      96,     64,     3,        6,      3360,   1050,   1,     0,     0,        0,       60}, // 总3360x1050(1x2 mode 水平)--单(1680x1050 @ 60Hz)
	//	{32400, 3200,     1120,    1200,     50,      128,   384,     1,        3,      3200,   1200,   1,     1,     0,        0,       60}, // 总3200x1200(1x2 mode 水平)--单(1600x1200 @ 60Hz)  - flv不成立
	{17750, 2880,     320,     900,      26,      96,     64,     3,        6,      2880,   900,    1,     0,     0,        0,       60}, // 总2880x900 (1x2 mode 水平)--单(1440x900  @ 60Hz)
	//	{20200, 2800,     320,     1050,     30,      96,     64,     3,        4,      2800,   1050,   1,     0,     0,        0,       60}, // 总2800X1050(1x2 mode 水平)--单(1400x1050 @ 60Hz)
	//  {14400, 2732,     268,     768,      32,      28,     112,    1,        3,      2732,   768,    1,     1,     0,        0,       60}, // 总2732x768 (1x2 mode 水平)--单(1366x768  @ 60Hz)
	{17100, 2720,     864,     768,      27,      128,    224,    3,        6,      2720,   768,    1,     1,     0,        0,       60}, // 总2720x768 (1x2 mode 水平)--单(1360x768  @ 60Hz)
	{21600, 2560,     816,     1024,     42,      96,     224,    1,        3,      2560,   1024,   1,     1,     0,        0,       60}, // 总2560x1024(1x2 mode 水平)--单(1280x1024 @ 60Hz)
	{27000, 2560,     816,     1024,     42,      32,     288,    1,        3,      2560,   1024,   1,     1,     0,        0,       60}, // 总2560x1024(1x2 mode 水平)--单(1280x1024 @ 60Hz)
	//	{30600, 2560,     816,     1024,     42,      32,     288,    1,        3,      2560,   1024,   1,     1,     0,        0,       60}, // 总2560x1024(1x2 mode 水平)--单(1280x1024 @ 60Hz)
	{21600, 2560,     1040,    960,      40,      192,    224,    1,        3,      2560,   960,    1,     1,     0,        0,       60}, // 总2560x960 (1x2 mode 水平)--单(1280x960  @ 60Hz)
	{16700, 2560,     800,     800,      31,      144,    256,    3,        6,      2560,   800,    0,     1,     0,        0,       60}, // 总2560x800 (1x2 mode 水平)--单(1280x800  @ 60Hz)
	{13650, 2560,     320,     768,      22,      96,     64,     3,        7,      2560,   768,    1,     0,     0,        0,       60}, // 总2560x768 (1x2 mode 水平)--单(1280x768  @ 60Hz)
	//	{14850, 2560,     1400,    720,      30,      880,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       50}, // 总2560x720 (1x2 mode 水平)--单(1280x720  @ 50Hz)
	{14850, 2560,     740,     720,      30,      220,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       60}, // 总2560x720 (1x2 mode 水平)--单(1280x720  @ 60Hz)
	//	{10378, 2048,     576,     768,      23,      80,     208,    1,        3,      2048,   768,    0,     1,     0,        0,       50}, // 总2048x768 (1x2 mode 水平)--单(1024x768  @ 50Hz)
	{13000, 2048,     640,     768,      38,      48,     272,    3,        6,      2048,   768,    0,     0,     0,        0,       60}, // 总2048x768 (1x2 mode 水平)--单(1024x768  @ 60Hz)
	{15750, 2048,     576,     768,      32,      32,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       75}, // 总2048x768 (1x2 mode 水平)--单(1024x768  @ 75Hz)
	{18900, 2048,     704,     768,      40,      96,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       85}, // 总2048x768 (1x2 mode 水平)--单(1024x768  @ 85Hz)
	{8000,  1600,     512,     600,      28,      80,     256,    1,        4,      1600,   600,    1,     1,     0,        0,       60}, // 总1600x600 (1x2 mode 水平)--单(800x600   @ 60Hz)
	{9900,  1600,     512,     600,      25,      32,     160,    1,        3,      1600,   600,    1,     1,     0,        0,       75}, // 总1600x600 (1x2 mode 水平)--单(800x600   @ 75Hz)
	{11250, 1600,     496,     600,      31,      64,     128,    1,        3,      1600,   600,    1,     1,     0,        0,       85}, // 总1600x600 (1x2 mode 水平)--单(800x600   @ 85Hz)

	//3x1垂直
	{29400, 1680,     120,     3150,     117,      48,     32,     9,        18,     1680,   3150,   1,     0,     0,        0,       50}, /* 总1680x3150(3x1 mode 垂直)--单(1680x1050 @ 50Hz) -fv*/ 
	{30660, 1600,     80,      3600,     50,      16,     16,     1,        3,      1600,   3600,   1,     1,     0,        0,       50}, /* 总1600x3600(3x1 mode 垂直)--单(1600x1200 @ 50Hz) */ 
	{29030, 1600,     128,     2700,     100,     48,     32,     1,        3,      1600,   2700,   1,     1,     0,        0,       60}, /* 总1600x2700(3x1 mode 垂直)--单(1600x900  @ 60Hz REDUCED) -fv*/ 
	{26900, 1440,     160,     2700,     102,     48,     32,     9,        18,     1440,   2700,   1,     0,     0,        0,       60}, /* 总1440x2700(3x1 mode 垂直)--单(1440x900  @ 60Hz) -fv*/                                                                                                                            
	{28850, 1400,     72,      3150,     117,     16,     16,     9,        12,     1400,   3150,   1,     0,     0,        0,       60}, /* 总1400x3150(3x1 mode 垂直)--单(1400x1050 @ 60Hz) -fv*/                                                                                                                     
	{25649, 1366,     426,     2304,      81,      64,     112,    9,        9,      1366,   2304,   1,     1,     0,        0,       60}, /* 总1366x2304(1x3 mode 垂直)--单(1366x768  @ 60Hz) */ 

	{25649, 1360,     432,     2304,     81,      64,     112,    9,        9,      1360,   2304,   1,     1,     0,        0,       60}, // 总1360x2304(3x1 mode 垂直)--单(1360x768  @ 60Hz)  
	{27630, 1280,     160,     3072,     126,     48,     32,     3,        9,      1280,   3072,   1,     1,     0,        0,       60}, // 总1280x3072(3x1 mode 垂直)--单(1280x1024 @ 60Hz) - Flv
	{25920, 1280,     160,     2880,     120,     48,     32,     3,        9,      1280,   2880,   1,     1,     0,        0,       60}, // 总1280x2880(3x1 mode 垂直)--单(1280x960  @ 60Hz) - Flv   
	{25050, 1280,     400,     2400,     93,      72,     128,    9,        18,     1280,   2400,   0,     1,     0,        0,       60}, // 总1280x2400(3x1 mode 垂直)--单(1280x800  @ 60Hz)
	{23850, 1280,     384,     2304,     90,      64,     128,    9,        21,     1280,   2304,   1,     0,     0,        0,       60}, // 总1280x2304(3x1 mode 垂直)--单(1280x768  @ 60Hz)
	{22300, 1280,     372,     2160,     90,      110,    40,     15,       15,     1280,   2160,   1,     1,     0,        0,       60}, // 总1280x2160(3x1 mode 垂直)--单(1280x720  @ 60Hz)(DP)
	{19500, 1024,     320,     2304,     114,     24,     136,    9,        18,     1024,   2304,   0,     0,     0,        0,       60}, // 总1024x2304(3x1 mode 垂直)--单(1024x768  @ 60Hz)
	{23625, 1024,     288,     2304,     96,      24,     96,     3,        9,      1024,   2304,   1,     1,     0,        0,       75}, // 总1024x2304(3x1 mode 垂直)--单(1024x768  @ 75Hz)
	{28350, 1024,     352,     2304,     120,     64,     96,     3,        9,      1024,   2304,   1,     1,     0,        0,       85}, // 总1024x2304(3x1 mode 垂直)--单(1024x768  @ 85Hz)                                                                               
	{12000, 800,      256,     1800,     84,      40,     128,    3,        12,     800,    1800,   1,     1,     0,        0,       60}, // 总800x1800 (3x1 mode 垂直)--单(800x600   @ 60Hz)
	{14850, 800,      256,     1800,     75,      16,     80,     3,        9,      800,    1800,   1,     1,     0,        0,       75}, // 总800x1800 (3x1 mode 垂直)--单(800x600   @ 75Hz)
	{16875, 800,      248,     1800,     93,      32,     64,     3,        9,      800,    1800,   1,     1,     0,        0,       85}, // 总800x1800 (3x1 mode 垂直)--单(800x600   @ 85Hz)
	{10030, 800,      256,     1440,     135,     48,     128,    30,       6,      800,    1440,   0,     0,     0,        0,       60}, // 总800x1440 (3x1 mode 垂直)--单(800x480   @ 60Hz) 
	{7183,  640,      144,     1440,     87,      8,      96,     6,        2,      640,    1440,   0,     0,     0,        0,       60}, // 总640x1440 (3x1 mode 垂直)--单(640x480   @ 60Hz)
	{8979,  640,      144,     1440,     87,      8,      96,     6,        2,      640,    1440,   0,     0,     0,        0,       75}, // 总640x1440 (3x1 mode 垂直)--单(640x480   @ 75Hz)
	{10176, 640,      144,     1440,     87,      8,      96,     6,        2,      640,    1440,   0,     0,     0,        0,       85}, // 总640x1440 (3x1 mode 垂直)--单(640x480   @ 85Hz)   

	//2x1 垂直 
	{25688, 1920,     160,     2400,     70,      48,     32,     6,        12,     1920,   2400,   1,     0,     0,        0,       50}, // 总1920x2400(2x1 mode 垂直)--单(1920x1200 @ 50Hz)    
	{28080, 1920,     160,     2160,     90,      48,     32,     8,        10,     1920,   2160,   1,     1,     0,        0,       60}, // 总1920x2160(2x1 mode 垂直)--单(1920x1080 @ 60Hz)   
	{29250, 1680,     560,     2100,     78,      104,    176,    6,        12,     1680,   100,    1,     0,     0,        0,       60}, // 总1680x2100(2x1 mode 垂直)--单(1680x1050 @ 60Hz) 
	//    {27000, 1600,     560,     2400,     100,     64,     192,    2,        6,      1600,   2400,   1,     1,     0,        0,       50}, // 总1600x2400(2x1 mode 垂直)--单(1600x1200 @ 50Hz)
	//  {21600, 1600,     200,     1800,     200,     24,     80,     2,        6,      1600,   1800,   1,     1,     0,        0,       60}, // 总1600x1800(2x1 mode 垂直)--单(1600x900  @ 60Hz REDUCED)
	{21300, 1440,     464,     1800,     68,      80,     152,    6,        12,     1440,   1800,   1,     0,     0,        0,       60}, // 总1440x1800(2x1 mode 垂直)--单(1440x900  @ 60Hz)
	//  {24350, 1400,     464,     2100,     78,      88,     144,    6,        8,      1400,   2100,   1,     0,     0,        0,       60}, // 总1400x2100(2x1 mode 垂直)--单(1400x1050 @ 60Hz) 
	//  {17100, 1366,     426,     1536,     54,      64,     112,    6,        12,     1366,   1536,   1,     1,     0,        0,       60}, // 总1366x1536(2x1 mode 垂直)--单(1366x768  @ 60Hz)
	{17100, 1360,     432,     1536,     54,      64,     112,    6,        6,      1360,   1536,   1,     1,     0,        0,       60}, // 总1360x1536(2x1 mode 垂直)--单(1360x768  @ 60Hz)
	{21600, 1280,     408,     2048,     84,      48,     112,    2,        6,      1280,   2048,   1,     1,     0,        0,       60}, // 总1280x2048(2x1 mode 垂直)--单(1280x1024 @ 60Hz)
	{26991, 1280,     408,     2048,     84,      16,     114,    2,        6,      1280,   2048,   1,     1,     0,        0,       75}, // 总1280x2048(2x1 mode 垂直)--单(1280x1024 @ 75Hz)
	//    {31491, 1280,     448,     2048,     96,      64,     160,    2,        6,      1280,   2048,   1,     1,     0,        0,       85}, // 总1280x2048(2x1 mode 垂直)--单(1280x1024 @ 85Hz) 
	{21600, 1280,     520,     1920,     80,      96,     112,    2,        6,      1280,   1920,   1,     1,     0,        0,       60}, // 总1280x1920(2x1 mode 垂直)--单(1280x960  @ 60Hz) 
	{16700, 1280,     400,     1600,     46,      72,     128,    6,        12,     1280,   1600,   0,     1,     0,        0,       60}, // 总1280x1600(2x1 mode 垂直)--单(1280x800  @ 60Hz)                                                                                                             
	{13651, 1280,     160,     1536,     44,      48,     32,     6,        14,     1280,   1536,   1,     0,     0,        0,       60}, // 总1280x1536(2x1 mode 垂直)--单(1280x768  @ 60Hz REDUCED)
	{14850, 1280,     370,     1440,     60,      110,    40,     10,       10,     1280,   1440,   1,     1,     0,        0,       60}, // 总1280x1440(2x1 mode 垂直)--单(1280x720  @ 60Hz) 
	{13000, 1024,     320,     1536,     76,      24,     136,    6,        12,     1024,   1536,   0,     0,     0,        0,       60}, // 总1024x1536(2x1 mode 垂直)--单(1024x768  @ 60Hz) 
	{15750, 1024,     288,     1536,     64,      16,     96,     2,        6,      1024,   1536,   1,     1,     0,        0,       75}, // 总1024x1536(2x1 mode 垂直)--单(1024x768  @ 75Hz)  
	{18900, 1024,     352,     1536,     80,      48,     96,     2,        6,      1024,   1536,   1,     1,     0,        0,       85}, // 总1024x1536(2x1 mode 垂直)--单(1024x768  @ 85Hz)	
	{8000,  800,      256,     1200,     56,      40,     128,    2,        8,      800,    1200,   1,     1,     0,        0,       60}, // 总800x1200 (2x1 mode 垂直)--单(800x600   @ 60Hz)
	{9900,  800,      256,     1200,     50,      16,     80,     2,        6,      800,    1200,   1,     1,     0,        0,       75}, // 总800x1200 (2x1 mode 垂直)--单(800x600   @ 75Hz) 
	{11250, 800,      248,     1200,     62,      32,     64,     2,        6,      800,    1200,   1,     1,     0,        0,       85}, // 总800x1200 (2x1 mode 垂直)--单(800x600   @ 85Hz) 

	//1x1单屏
	{15400, 1920,     160,     1200,     35,      48,     32 ,    3,        6,      1920,   1200,   1,     0,     0,        0,       60}, // 总1920x1200(2x1 mode 垂直)--单(1920x1200 @ 60Hz) 
	{14850, 1920,     280,     1080,     45,      88,     44 ,    4,        5,      1920,   1080,   1,     1,     0,        0,       60}, // 总1920x1080(2x1 mode 垂直)--单(1920x1080 @ 60Hz) 
	{13412, 1600,     160,     1200,     71,      48,     32,     3,        4,      1600,   1200,   1,     0,     0,        0,       60}, // 总1600x1200(2x1 mode 垂直)--单(1600x1200 @ 60Hz)   reduced blank from 120Hz version
};
//----------------------------------- END --------------------------------------------/


/***************************** MV103S_HDVE_120Hz *****************************************/
//
// 以下为 MV103S_HDVE_120Hz  的所有分辨率 , 与之前的MV103_HDVE_PRO版的分辨率一样，修改某些 Hblack%4 ！=0 的分辨率 
// 支持50Hz,60Hz,75Hz,85Hz等 ， 以及支持部分Flexview的分辨率， 且仅支持1x2,1x3,1x1水平分割模式  
//-----------------------------------<<< 中文版 >>>-----------------------------------------------------------
#ifndef ENGLISHVER
CString m_MV103S_HDVE_120Hz_strTimings[] = {
	// 1x3 水平
	_T("5760x1080 @ 50Hz(1x3 Mode 水平)(单屏 1920x1080 @ 50Hz)"),     /* mode 27 : wide timing */
	_T("5040x1050 @ 60Hz(1x3 Mode 水平)(单屏 1680x1050 @ 60Hz)"),     /* mode 26 : wide timing */
	_T("4800x900  @ 60Hz(1x3 Mode 水平)(单屏 1600x900  @ 60Hz)"),     /* mode 25 : wide timing */
	_T("4320x900  @ 60Hz(1x3 Mode 水平)(单屏 1440x900  @ 60Hz)"),     /* mode 22 : wide timing */
	_T("4200x1050 @ 50Hz(1x3 Mode 水平)(单屏 1400x1050 @ 50Hz)"),     /* mode 23 : wide timing */
	_T("4200x1050 @ 60Hz(1x3 Mode 水平)(单屏 1400x1050 @ 60Hz)"),     /* mode 24 : wide timing */
	_T("4098x768  @ 50Hz(1x3 Mode 水平)(单屏 1366x768  @ 50Hz)"),     /* mode 20 : wide timing */
	_T("4098x768  @ 60Hz(1x3 Mode 水平)(单屏 1366x768  @ 60Hz)"),     /* mode 21 : wide timing */
	_T("4080x768  @ 60Hz(1x3 Mode 水平)(单屏 1360x768  @ 60Hz)"),     /* mode 19 */
	_T("3840x1024 @ 50Hz(1x3 Mode 水平)(单屏 1280x1024 @ 50Hz)"),     /* mode 0  */ 
	_T("3840x1024 @ 60Hz(1x3 Mode 水平)(单屏 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("3840x960  @ 60Hz(1x3 Mode 水平)(单屏 1280x960  @ 60Hz)"),     /* mode 2  */
	_T("3840x800  @ 50Hz(1x3 Mode 水平)(单屏 1280x800  @ 50Hz)"),     /* mode 3  */
	_T("3840x800  @ 60Hz(1x3 Mode 水平)(单屏 1280x800  @ 60Hz)"),     /* mode 4  */
	_T("3840x800  @ 60Hz_FD(1x3 Mode 水平)(单屏 1280x800 @ 60Hz_FD)"),     /* mode 61*/
	_T("3840x800  @ 60Hz_RD(1x3 Mode 水平)(单屏 1280x800 @ 60Hz_RD)"),      /* mode 62*/  
	_T("3840x768  @ 60Hz(1x3 Mode 水平)(单屏 1280x768  @ 60Hz)"),     /* mode 5  */
	_T("3840x720  @ 50Hz(1x3 Mode 水平)(单屏 1280x720  @ 50Hz)"),     /* mode 6  */
	_T("3840x720  @ 60Hz(1x3 Mode 水平)(单屏 1280x720  @ 60Hz)"),     /* mode 7  */
	_T("3072x768  @ 50Hz(1x3 Mode 水平)(单屏 1024x768  @ 50Hz)"),     /* mode 8  */
	_T("3072x768  @ 60Hz(1x3 Mode 水平)(单屏 1024x768  @ 60Hz)"),     /* mode 9  */
	_T("3072x768  @ 75Hz(1x3 Mode 水平)(单屏 1024x768  @ 75Hz)"),     /* mode 10  */
	_T("3072x768  @ 85Hz(1x3 Mode 水平)(单屏 1024x768  @ 85Hz)"),     /* mode 11 */
	_T("2400x600  @ 60Hz(1x3 Mode 水平)(单屏 800x600   @ 60Hz)"),     /* mode 12 */
	_T("2400x600  @ 75Hz(1x3 Mode 水平)(单屏 800x600   @ 75Hz)"),     /* mode 13 */
	_T("2400x600  @ 85Hz(1x3 Mode 水平)(单屏 800x600   @ 85Hz)"),     /* mode 14 */
	_T("2400x480  @ 60Hz(1x3 Mode 水平)(单屏 800x480   @ 60Hz)"),     /* mode 15 */
	_T("1920x480  @ 60Hz(1x3 Mode 水平)(单屏 640x480   @ 60Hz)"),     /* mode 16 */
	_T("1920x480  @ 75Hz(1x3 Mode 水平)(单屏 640x480   @ 75Hz)"),     /* mode 17 */
	_T("1920x480  @ 85Hz(1x3 Mode 水平)(单屏 640x480   @ 85Hz)"),     /* mode 18 */

	// 1x2 水平
	_T("4096x1152 @ 60Hz(1x2 Mode 水平)(单屏 2048x1152 @ 60Hz)"),     /* mode 28 : wide timing */
	_T("4096x1080 @ 60Hz(1x2 Mode 水平)(单屏 2048x1080 @ 60Hz)"),     /* mode 29 : wide timing */
	_T("4096x1200 @ 60Hz(1x2 Mode 水平)(单屏 2048x1200 @ 60Hz)"),     /* mode 30 : wide timing */
	_T("4096x1080 @ 50Hz(1x2 Mode 水平)(单屏 2048x1080 @ 50Hz)"),     /* mode 31 : wide timing */
	_T("4096x1200 @ 50Hz(1x2 Mode 水平)(单屏 2048x1200 @ 50Hz)"),     /* mode 32 : wide timing */
	_T("3840x1200 @ 60Hz(1x2 Mode 水平)(单屏 1920x1200 @ 60Hz)"),     /* mode 33 */
	_T("3840x1080 @ 50Hz(1x2 Mode 水平)(单屏 1920x1080 @ 50Hz)"),     /* mode 34 */
	_T("3840x1080 @ 60Hz(1x2 Mode 水平)(单屏 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("3360x1050 @ 60Hz(1x2 Mode 水平)(单屏 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("3200x1200 @ 60Hz(1x2 Mode 水平)(单屏 1600x1200 @ 60Hz)"),	    /* mode 37 */
	_T("2880x900  @ 60Hz(1x2 Mode 水平)(单屏 1440x900  @ 60Hz)"),     /* mode 38 */
	_T("2800x1050 @ 75Hz(1x2 Mode 水平)(单屏 1400x1050 @ 75Hz)"),     /* mode 39 */
	_T("2800x1050 @ 60Hz(1x2 Mode 水平)(单屏 1400x1050 @ 60Hz)"),     /* mode 40 */
	_T("2732x768  @ 60Hz(1x2 Mode 水平)(单屏 1366x768  @ 60Hz)"),     /* mode 41 */
	_T("2720x768  @ 60Hz(1x2 Mode 水平)(单屏 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("2560x1024 @ 60Hz(1x2 Mode 水平)(单屏 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode 水平)(单屏 1280x1024 @ 75Hz)"),     /* mode 44 */
	_T("2560x1024 @ 85Hz(1x2 Mode 水平)(单屏 1280x1024 @ 85Hz)"),     /* mode 45 */
	_T("2560x960  @ 60Hz(1x2 Mode 水平)(单屏 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode 水平)(单屏 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode 水平)(单屏 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("2560x720  @ 50Hz(1x2 Mode 水平)(单屏 1280x720  @ 50Hz)"),     /* mode 49 */
	_T("2560x720  @ 60Hz(1x2 Mode 水平)(单屏 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("2048x768  @ 50Hz(1x2 Mode 水平)(单屏 1024x768  @ 50Hz)"),     /* mode 51 */
	_T("2048x768  @ 60Hz(1x2 Mode 水平)(单屏 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode 水平)(单屏 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode 水平)(单屏 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode 水平)(单屏 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode 水平)(单屏 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode 水平)(单屏 800x600   @ 85Hz)"),     /* mode 57 */

	// 1x1 单屏
	_T("1920x1200 @ 60Hz(1x1 Mode 单屏)"),	    /* mode 58*/
	_T("1920x1080 @ 60Hz(1x1 Mode 单屏)"),	    /* mode 59*/
	_T("1600x1200 @ 60Hz(1x1 Mode 单屏)"),       /* mode 60*/

#ifdef MV103_120HZ
	_T("1*1024x768  @ 120Hz"),	    /* mode add*/
	_T("2*1024x768  @ 120Hz"),	    /* mode add*/
	_T("3*1024x768  @ 120Hz")	    /* mode add*/
#endif

	_T("END"),
};

//-----------------------------------<<<  英文版 >>>----------------------------------------------------------
#else
CString m_MV103S_HDVE_120Hz_strTimings[] = {
	// 1x3 Horizontal
	_T("5760x1080 @ 50Hz(1x3 Mode Horizontal)(Single-screen 1920x1080 @ 50Hz)"),     /* mode 27 : wide timing */
	_T("5040x1050 @ 60Hz(1x3 Mode Horizontal)(Single-screen 1680x1050 @ 60Hz)"),     /* mode 26 : wide timing */
	_T("4800x900  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1600x900  @ 60Hz)"),     /* mode 25 : wide timing */
	_T("4320x900  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1440x900  @ 60Hz)"),     /* mode 22 : wide timing */
	_T("4200x1050 @ 50Hz(1x3 Mode Horizontal)(Single-screen 1400x1050 @ 50Hz)"),     /* mode 23 : wide timing */
	_T("4200x1050 @ 60Hz(1x3 Mode Horizontal)(Single-screen 1400x1050 @ 60Hz)"),     /* mode 24 : wide timing */
	_T("4098x768  @ 50Hz(1x3 Mode Horizontal)(Single-screen 1366x768  @ 50Hz)"),     /* mode 20 : wide timing */
	_T("4098x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1366x768  @ 60Hz)"),     /* mode 21 : wide timing */
	_T("4080x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1360x768  @ 60Hz)"),     /* mode 19 */
	_T("3840x1024 @ 50Hz(1x3 Mode Horizontal)(Single-screen 1280x1024 @ 50Hz)"),     /* mode 0  */ 
	_T("3840x1024 @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("3840x960  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x960  @ 60Hz)"),     /* mode 2  */
	_T("3840x800  @ 50Hz(1x3 Mode Horizontal)(Single-screen 1280x800  @ 50Hz)"),     /* mode 3  */
	_T("3840x800  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x800  @ 60Hz)"),     /* mode 4  */
	_T("3840x800  @ 60Hz_FD(1x3 Mode Horizontal)(Single-screen 1280x800 @ 60Hz_FD)"),     /* mode 61*/
	_T("3840x800  @ 60Hz_RD(1x3 Mode Horizontal)(Single-screen 1280x800 @ 60Hz_RD)"),      /* mode 62*/  
	_T("3840x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x768  @ 60Hz)"),     /* mode 5  */
	_T("3840x720  @ 50Hz(1x3 Mode Horizontal)(Single-screen 1280x720  @ 50Hz)"),     /* mode 6  */
	_T("3840x720  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x720  @ 60Hz)"),     /* mode 7  */
	_T("3072x768  @ 50Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 50Hz)"),     /* mode 8  */
	_T("3072x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 60Hz)"),     /* mode 9  */
	_T("3072x768  @ 75Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 75Hz)"),     /* mode 10  */
	_T("3072x768  @ 85Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 85Hz)"),     /* mode 11 */
	_T("2400x600  @ 60Hz(1x3 Mode Horizontal)(Single-screen 800x600   @ 60Hz)"),     /* mode 12 */
	_T("2400x600  @ 75Hz(1x3 Mode Horizontal)(Single-screen 800x600   @ 75Hz)"),     /* mode 13 */
	_T("2400x600  @ 85Hz(1x3 Mode Horizontal)(Single-screen 800x600   @ 85Hz)"),     /* mode 14 */
	_T("2400x480  @ 60Hz(1x3 Mode Horizontal)(Single-screen 800x480   @ 60Hz)"),     /* mode 15 */
	_T("1920x480  @ 60Hz(1x3 Mode Horizontal)(Single-screen 640x480   @ 60Hz)"),     /* mode 16 */
	_T("1920x480  @ 75Hz(1x3 Mode Horizontal)(Single-screen 640x480   @ 75Hz)"),     /* mode 17 */
	_T("1920x480  @ 85Hz(1x3 Mode Horizontal)(Single-screen 640x480   @ 85Hz)"),     /* mode 18 */

	// 1x2 Horizontal
	_T("4096x1152 @ 60Hz(1x2 Mode Horizontal)(Single-screen 2048x1152 @ 60Hz)"),     /* mode 28 : wide timing */
	_T("4096x1080 @ 60Hz(1x2 Mode Horizontal)(Single-screen 2048x1080 @ 60Hz)"),     /* mode 29 : wide timing */
	_T("4096x1200 @ 60Hz(1x2 Mode Horizontal)(Single-screen 2048x1200 @ 60Hz)"),     /* mode 30 : wide timing */
	_T("4096x1080 @ 50Hz(1x2 Mode Horizontal)(Single-screen 2048x1080 @ 50Hz)"),     /* mode 31 : wide timing */
	_T("4096x1200 @ 50Hz(1x2 Mode Horizontal)(Single-screen 2048x1200 @ 50Hz)"),     /* mode 32 : wide timing */
	_T("3840x1200 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1920x1200 @ 60Hz)"),     /* mode 33 */
	_T("3840x1080 @ 50Hz(1x2 Mode Horizontal)(Single-screen 1920x1080 @ 50Hz)"),     /* mode 34 */
	_T("3840x1080 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("3360x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("3200x1200 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1600x1200 @ 60Hz)"),	    /* mode 37 */
	_T("2880x900  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1440x900  @ 60Hz)"),     /* mode 38 */
	_T("2800x1050 @ 75Hz(1x2 Mode Horizontal)(Single-screen 1400x1050 @ 75Hz)"),     /* mode 39 */
	_T("2800x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1400x1050 @ 60Hz)"),     /* mode 40 */
	_T("2732x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1366x768  @ 60Hz)"),     /* mode 41 */
	_T("2720x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("2560x1024 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 75Hz)"),     /* mode 44 */
	_T("2560x1024 @ 85Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 85Hz)"),     /* mode 45 */
	_T("2560x960  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("2560x720  @ 50Hz(1x2 Mode Horizontal)(Single-screen 1280x720  @ 50Hz)"),     /* mode 49 */
	_T("2560x720  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("2048x768  @ 50Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 50Hz)"),     /* mode 51 */
	_T("2048x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 85Hz)"),     /* mode 57 */

	// 1x1 单屏
	_T("1920x1200 @ 60Hz(1x1 Mode Single-screen)"),	    /* mode 58*/
	_T("1920x1080 @ 60Hz(1x1 Mode Single-screen)"),	    /* mode 59*/
	_T("1600x1200 @ 60Hz(1x1 Mode Single-screen)"),       /* mode 60*/

#ifdef MV103_120HZ
	_T("1*1024x768  @ 120Hz"),	    /* mode add*/
	_T("2*1024x768  @ 120Hz"),	    /* mode add*/
	_T("3*1024x768  @ 120Hz")	    /* mode add*/
#endif

	_T("END"),
};

#endif

TIMING_STRUCT MV103S_HDVE_120Hz_detailed_timings[] ={
	//Fpixel  h_active  h_blank v_active  v_blank  h_front h_synct v_front  v_synct  h_size, v_size, h_pol, v_pol, h_border, v_border, Hz
	// 1x3 水平
	{32670,  5760,     48,      1080,     45,      16,     16,     4,        5,      5040,   1080,   1,     0,     0,        0,       50}, // 总5760x1080(1x3 水平)--单(1920x1080 @ 50Hz)(RDC, Non-RDC) - flv
	{32970,  5040,     48,      1050,     30,      16,     16,     3,        6,      5040,   1050,   1,     0,     0,        0,       60}, // 总5040x1050(1x3 水平)--单(1680x1050 @ 60Hz)(RDC)          - flv
	{31200,  4800,     786,     900,      32,      262,    262,    1,        3,      4800,   900,    1,     1,     0,        0,       60}, // 总4800x900 (1x3 水平)--单(1600x900  @ 60Hz)(Non-RDC)      - flv
	{26625,  4320,     480,     900,      26,      144,    96,     3,        6,      4320,   900,    1,     0,     0,        0,       60}, // 总4320x900 (1x3 水平)--单(1440x900  @ 60Hz)(RDC)	
	{25250,  4200,     480,     1050,     30,      144,    96,     3,        4,      4200,   1050,   1,     0,     0,        0,       50}, // 总4200x1050(1x3 水平)--单(1400x900  @ 50Hz) wide timings, reduce blank, 
	{30300,  4200,     480,     1050,     30,      144,    96,     3,        4,      4200,   1050,   1,     0,     0,        0,       60}, // 总4200x1050(1x3 水平)--单(1400x900  @ 60Hz) wide timings, reduce blank, 	
	{21375,  4098,     1278,    768,      27,      192,    336,    3,        6,      4098,   768,    1,     1,     0,        0,       50}, // 总4098x768 (1x3 水平)--单(1366x768  @ 50Hz) wide timings
	{25650,  4098,     1278,    768,      27,      192,    336,    3,        6,      4098,   768,    1,     1,     0,        0,       60}, // 总4098x768 (1x3 水平)--单(1366x768  @ 60Hz) wide timings	
	{25644,  4080,     1296,    768,      27,      192,    336,    3,        6,      4080,   768,    1,     1,     0,        0,       60}, // 总4080x768 (1x3 水平)--单(1360x768  @ 60Hz)
	{28350,  3840,     1200,    1024,     101,     120,    420,    1,        3,      3840,   1024,   1,     1,     0,        0,       50}, // 总3840x1024(1x3 水平)--单(1280x1024 @ 50Hz)  
	{32400,  3840,     1224,    1024,     42,      144,    336,    1,        3,      3840,   1024,   1,     1,     0,        0,       60}, // 总3840x1024(1x3 水平)--单(1280x1024 @ 60Hz) 
	{32400,  3840,     1560,    960,      40,      288,    336,    1,        3,      3840,   960,    1,     1,     0,        0,       60}, // 总3840x960 (1x3 水平)--单(1280x960  @ 60Hz) 
	{17777,  3840,     480,     800,      23,      144,    96,     3,        6,      3840,   800,    0,     1,     0,        0,       50}, // 总3840x800 (1x3 水平)--单(1280x800  @ 50Hz) 
	{25050,  3840,     1200,     800,     31,      216,    384,    3,        6,      3840,   800,    0,     1,     0,        0,       60}, // 总3840x800 (1x3 水平)--单(1280x800  @ 60Hz) 
	{21779,  3840,     528,     800,      31,      36,    192,     3,        3,      3840,   800,    0,     0,     0,        0,       60}, // 总3840x800 (1x3 水平)--单(1280x800  @ 60Hz_FD) 
	{21954,  3840,     480,     800,      47,      144,    96,     3,        6,      3840,   800,    1,     0,     0,        0,       60}, // 总3840x800 (1x3 水平)--单(1280x800  @ 60Hz_RD) 
	{20475,  3840,     480,     768,      22,      144,    96,     3,        7,      3840,   768,    1,     0,     0,        0,       60}, // 总3840x768 (1x3 水平)--单(1280x768  @ 60Hz) 
	{22275,  3840,     2100,    720,      30,      1320,   120,    5,        5,      3840,   720,    1,     1,     0,        0,       50}, // 总3840x720 (1x3 水平)--单(1280x720  @ 50Hz) 
	{22300,  3840,     1116,    720,      30,      330,    120,    5,        5,      3840,   720,    1,     1,     0,        0,       60}, // 总3840x720 (1x3 水平)--单(1280x720  @ 60Hz)(DP)
	{15567,  3072,     864,     768,      23,      120,    312,    1,        3,      3072,   768,    0,     1,     0,        0,       50}, // 总3072x768 (1x3 水平)--单(1024x768  @ 50Hz) 
	{19500,  3072,     960,     768,      38,      72,     408,    3,        6,      3072,   768,    0,     0,     0,        0,       60}, // 总3072x768 (1x3 水平)--单(1024x768  @ 60Hz) 
	{23625,  3072,     864,     768,      32,      48,     288,    1,        3,      3072,   768,    1,     1,     0,        0,       75}, // 总3072x768 (1x3 水平)--单(1024x768  @ 75Hz) 
	{28350,  3072,     1056,    768,      40,      192,    288,    1,        3,      3072,   768,    1,     1,     0,        0,       85}, // 总3072x768 (1x3 水平)--单(1024x768  @ 85Hz) 
	{12000,  2400,     768,     600,      28,      120,    384,    1,        4,      2400,   600,    1,     1,     0,        0,       60}, // 总2400x600 (1x3 水平)--单(800x600   @ 60Hz) 
	{14850,  2400,     768,     600,      25,      48,     240,    1,        3,      2400,   600,    1,     1,     0,        0,       75}, // 总2400x600 (1x3 水平)--单(800x600   @ 75Hz) 
	{16875,  2400,     744,     600,      31,      96,     192,    1,        3,      2400,   600,    1,     1,     0,        0,       85}, // 总2400x600 (1x3 水平)--单(800x600   @ 85Hz) 
	{10030,  2400,     768,     480,      45,      144,    384,    10,       2,      2400,   480,    0,     0,     0,        0,       60}, // 总2400x480 (1x3 水平)--单(800x480   @ 60Hz) 
	{7553,   1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       60}, // 总1920x480 (1x3 水平)--单(640x480   @ 60Hz) 
	{9440,   1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       75}, // 总1920x480 (1x3 水平)--单(640x480   @ 75Hz) 
	{10700,  1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       85}, // 总1920x480 (1x3 水平)--单(640x480   @ 85Hz) 


	// 1x2 水平
	{31360,  4096,     320,     1152,     33,      96,     64,     3,        5,      4096,   1152,   1,     0,     0,        0,       60}, // 总4096x1152(1x2 水平)--单(2048x1152 @ 60Hz) wide timings	
	{29304,  4096,     320,     1080,     26,      96,     64,     3,        10,     4096,   1080,   1,     1,     0,        0,       60}, // 总4096x1080(1x2 水平)--单(2048x1080 @ 60Hz) wide timings
	{32484,  4096,     320,     1200,     26,      96,     64,     3,        5,      4096,   1200,   1,     0,     0,        0,       60}, // 总4096x1200(1x2 水平)--单(2048x1200 @ 60Hz) wide timings, mviewtech properitary timing
	{24420,  4096,     320,     1080,     26,      96,     64,     3,        10,     4096,   1080,   1,     1,     0,        0,       50}, // 总4096x1080(1x2 水平)--单(2048x1080 @ 50Hz) wide timings
	{27070,  4096,     320,     1200,     26,      96,     64,     3,        5,      4096,   1200,   1,     0,     0,        0,       50}, // 总4096x1200(1x2 水平)--单(2048x1200 @ 50Hz) wide timings, mviewtech properitary timing
	{30800,  3840,     320,     1200,     35,      96,     64,     3,        6,      3840,   1200,   1,     0,     0,        0,       60}, // 总3840x1200(1x2 水平)--单(1920x1200 @ 60Hz)
	{24750,  3840,     560,     1080,     45,      176,    88,     4,        5,      3840,   1080,   1,     1,     0,        0,       50}, // 总3840x1080(1x2 水平)--单(1920x1080 @ 50Hz) low pixel rate
	{29700,  3840,     560,     1080,     45,      176,    88,     4,        5,      3840,   1080,   1,     1,     0,        0,       60}, // 总3840x1080(1x2 水平)--单(1920x1080 @ 60Hz)
	{23800,  3360,     320,     1050,     30,      96,     64,     3,        6,      3360,   1050,   1,     0,     0,        0,       60}, // 总3360x1050(1x2 水平)--单(1680x1050 @ 60Hz)
	{32400,  3200,     1120,    1200,     50,      128,    384,    1,        3,      3200,   1200,   1,     1,     0,        0,       60}, // 总3200x1200(1x2 水平)--单(1600x1200 @ 60Hz)
	{17750,  2880,     320,     900,      26,      96,     64,     3,        6,      2880,   900,    1,     0,     0,        0,       60}, // 总2880x900 (1x2 水平)--单(1440x900  @ 60Hz)
	{25272,  2800,     320,     1050,     30,      96,     64,     3,        4,      2800,   1050,   1,     0,     0,        0,       75}, // 总2800x1050(1x2 水平)--单(1400x1050 @ 75Hz)
	{20200,  2800,     320,     1050,     30,      96,     64,     3,        4,      2800,   1050,   1,     0,     0,        0,       60}, // 总2800x1050(1x2 水平)--单(1400x1050 @ 60Hz)
	{14400,  2732,     268,     768,      32,      28,     112,    1,        3,      2732,   768,    1,     1,     0,        0,       60}, // 总2732x768 (1x2 水平)--单(1366x768  @ 60Hz)
	{17100,  2720,     864,     768,      27,      128,    224,    3,        6,      2720,   768,    1,     1,     0,        0,       60}, // 总2720x768 (1x2 水平)--单(1360x768  @ 60Hz)
	{21600,  2560,     816,     1024,     42,      96,     224,    1,        3,      2560,   1024,   1,     1,     0,        0,       60}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 60Hz)
	{27000,  2560,     816,     1024,     42,      32,     288,    1,        3,      2560,   1024,   1,     1,     0,        0,       75}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 75Hz)
	{30600,  2560,     816,     1024,     42,      32,     288,    1,        3,      2560,   1024,   1,     1,     0,        0,       85}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 85Hz)
	{21600,  2560,     1040,    960,      40,      192,    224,    1,        3,      2560,   960,    1,     1,     0,        0,       60}, // 总2560x900 (1x2 水平)--单(1280x900  @ 60Hz)
	{16700,  2560,     800,     800,      31,      144,    256,    3,        6,      2560,   800,    0,     1,     0,        0,       60}, // 总2560x800 (1x2 水平)--单(1280x800  @ 60Hz)
	{13650,  2560,     320,     768,      22,      96,     64,     3,        7,      2560,   768,    1,     0,     0,        0,       60}, // 总2560x768 (1x2 水平)--单(1280x768  @ 60Hz)
	{14850,  2560,     1400,    720,      30,      880,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       50}, // 总2560x720 (1x2 水平)--单(1280x720  @ 50Hz)
	{14850,  2560,     740,     720,      30,      220,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       60}, // 总2560x720 (1x2 水平)--单(1280x720  @ 60Hz)
	{10378,  2048,     576,     768,      23,      80,     208,    1,        3,      2048,   768,    0,     1,     0,        0,       50}, // 总2048x768 (1x2 水平)--单(1024x768  @ 50Hz)
	{13000,  2048,     640,     768,      38,      48,     272,    3,        6,      2048,   768,    0,     0,     0,        0,       60}, // 总2048x768 (1x2 水平)--单(1024x768  @ 60Hz)
	{15750,  2048,     576,     768,      32,      32,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       75}, // 总2048x768 (1x2 水平)--单(1024x768  @ 75Hz)
	{18900,  2048,     704,     768,      40,      96,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       85}, // 总2048x768 (1x2 水平)--单(1024x768  @ 85Hz)
	{8000,   1600,     512,     600,      28,      80,     256,    1,        4,      1600,   600,    1,     1,     0,        0,       60}, // 总1600x600 (1x2 水平)--单(800x600   @ 60Hz)
	{9900,   1600,     512,     600,      25,      32,     160,    1,        3,      1600,   600,    1,     1,     0,        0,       75}, // 总1600x600 (1x2 水平)--单(800x600   @ 75Hz)
	{11250,  1600,     496,     600,      31,      64,     128,    1,        3,      1600,   600,    1,     1,     0,        0,       85}, // 总1600x600 (1x2 水平)--单(800x600   @ 85Hz)

	// 1x1 单屏
	{15400,  1920,     160,     1200,     35,      48,     32 ,    3,        6,      1920,   1200,   1,     0,     0,        0,       60}, // 总1920x1200(1x1 水平)--单(1920x1200 @ 60Hz)
	{14850,  1920,     280,     1080,     45,      88,     44 ,    4,        5,      1920,   1080,   1,     1,     0,        0,       60}, // 总1920x1080(1x1 水平)--单(1920x1080 @ 60Hz)
	{13412,  1600,     160,     1200,     71,      48,     32,     3,        4,      1600,   1200,   1,     0,     0,        0,       60}, // 总1600x1200(1x1 水平)--单(1600x1200 @ 60Hz) reduced blank from 120Hz version

#ifdef MV103_120HZ
	{13000,  1024,     320,     768,      38,      24,     136,    3,        6,      1024,   768,    0,     0,     0,        0,       120}, // 总1024x768 (1x1 水平)--单(1024x768  @ 120Hz)
	{26000,  2048,     640,     768,      38,      48,     272,    3,        6,      2048,   768,    0,     0,     0,        0,       120}, // 总2048x768 (1x2 水平)--单(1024x768  @ 120Hz)
	{32380,  3072,     276,     768,      38,      48,     48,     3,        6,      3072,   768,    0,     0,     0,        0,       120}  // 总3072x768 (1x3 水平)--单(1024x768  @ 120Hz) 
#endif
};



/***************************** MV103S_HDVE_PRO *****************************************/
//
// 以下为 MV103S_HDVE_PRO  的所有分辨率 , 与之前的MV103_HDVE_PRO版的分辨率一样，修改某些 Hblack%4 ！=0 的分辨率 
// 支持50Hz,60Hz,75Hz,85Hz等 ， 以及支持部分Flexview的分辨率， 且仅支持1x2,1x3,1x1水平分割模式  
//-----------------------------------<<< 中文版 >>>-----------------------------------------------------------
#ifndef ENGLISHVER
CString m_MV103S_HDVE_PRO_strTimings[] = {
	// 1x3 水平
	_T("5760x1080 @ 50Hz(1x3 Mode 水平)(单屏 1920x1080 @ 50Hz)"),     /* mode 27 : wide timing */
	_T("5040x1050 @ 60Hz(1x3 Mode 水平)(单屏 1680x1050 @ 60Hz)"),     /* mode 26 : wide timing */
	_T("4800x900  @ 60Hz(1x3 Mode 水平)(单屏 1600x900  @ 60Hz)"),     /* mode 25 : wide timing */
	_T("4320x900  @ 60Hz(1x3 Mode 水平)(单屏 1440x900  @ 60Hz)"),     /* mode 22 : wide timing */
	_T("4200x1050 @ 50Hz(1x3 Mode 水平)(单屏 1400x1050 @ 50Hz)"),     /* mode 23 : wide timing */
	_T("4200x1050 @ 60Hz(1x3 Mode 水平)(单屏 1400x1050 @ 60Hz)"),     /* mode 24 : wide timing */
	_T("4098x768  @ 50Hz(1x3 Mode 水平)(单屏 1366x768  @ 50Hz)"),     /* mode 20 : wide timing */
	_T("4098x768  @ 60Hz(1x3 Mode 水平)(单屏 1366x768  @ 60Hz)"),     /* mode 21 : wide timing */
	_T("4080x768  @ 60Hz(1x3 Mode 水平)(单屏 1360x768  @ 60Hz)"),     /* mode 19 */
	_T("3840x1024 @ 50Hz(1x3 Mode 水平)(单屏 1280x1024 @ 50Hz)"),     /* mode 0  */ 
	_T("3840x1024 @ 60Hz(1x3 Mode 水平)(单屏 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("3840x960  @ 60Hz(1x3 Mode 水平)(单屏 1280x960  @ 60Hz)"),     /* mode 2  */
	_T("3840x800  @ 50Hz(1x3 Mode 水平)(单屏 1280x800  @ 50Hz)"),     /* mode 3  */
	_T("3840x800  @ 60Hz(1x3 Mode 水平)(单屏 1280x800  @ 60Hz)"),     /* mode 4  */
	_T("3840x800  @ 60Hz_FD(1x3 Mode 水平)(单屏 1280x800 @ 60Hz_FD)"),     /* mode 61*/
	_T("3840x800  @ 60Hz_RD(1x3 Mode 水平)(单屏 1280x800 @ 60Hz_RD)"),      /* mode 62*/  
	_T("3840x768  @ 60Hz(1x3 Mode 水平)(单屏 1280x768  @ 60Hz)"),     /* mode 5  */
	_T("3840x720  @ 50Hz(1x3 Mode 水平)(单屏 1280x720  @ 50Hz)"),     /* mode 6  */
	_T("3840x720  @ 60Hz(1x3 Mode 水平)(单屏 1280x720  @ 60Hz)"),     /* mode 7  */
	_T("3072x768  @ 50Hz(1x3 Mode 水平)(单屏 1024x768  @ 50Hz)"),     /* mode 8  */
	_T("3072x768  @ 60Hz(1x3 Mode 水平)(单屏 1024x768  @ 60Hz)"),     /* mode 9  */
	_T("3072x768  @ 75Hz(1x3 Mode 水平)(单屏 1024x768  @ 75Hz)"),     /* mode 10  */
	_T("3072x768  @ 85Hz(1x3 Mode 水平)(单屏 1024x768  @ 85Hz)"),     /* mode 11 */
	_T("2400x600  @ 60Hz(1x3 Mode 水平)(单屏 800x600   @ 60Hz)"),     /* mode 12 */
	_T("2400x600  @ 75Hz(1x3 Mode 水平)(单屏 800x600   @ 75Hz)"),     /* mode 13 */
	_T("2400x600  @ 85Hz(1x3 Mode 水平)(单屏 800x600   @ 85Hz)"),     /* mode 14 */
	_T("2400x480  @ 60Hz(1x3 Mode 水平)(单屏 800x480   @ 60Hz)"),     /* mode 15 */
	_T("1920x480  @ 60Hz(1x3 Mode 水平)(单屏 640x480   @ 60Hz)"),     /* mode 16 */
	_T("1920x480  @ 75Hz(1x3 Mode 水平)(单屏 640x480   @ 75Hz)"),     /* mode 17 */
	_T("1920x480  @ 85Hz(1x3 Mode 水平)(单屏 640x480   @ 85Hz)"),     /* mode 18 */

	// 1x2 水平
	_T("4096x1152 @ 60Hz(1x2 Mode 水平)(单屏 2048x1152 @ 60Hz)"),     /* mode 28 : wide timing */
	_T("4096x1080 @ 60Hz(1x2 Mode 水平)(单屏 2048x1080 @ 60Hz)"),     /* mode 29 : wide timing */
	_T("4096x1200 @ 60Hz(1x2 Mode 水平)(单屏 2048x1200 @ 60Hz)"),     /* mode 30 : wide timing */
	_T("4096x1080 @ 50Hz(1x2 Mode 水平)(单屏 2048x1080 @ 50Hz)"),     /* mode 31 : wide timing */
	_T("4096x1200 @ 50Hz(1x2 Mode 水平)(单屏 2048x1200 @ 50Hz)"),     /* mode 32 : wide timing */
	_T("3840x1200 @ 60Hz(1x2 Mode 水平)(单屏 1920x1200 @ 60Hz)"),     /* mode 33 */
	_T("3840x1080 @ 50Hz(1x2 Mode 水平)(单屏 1920x1080 @ 50Hz)"),     /* mode 34 */
	_T("3840x1080 @ 60Hz(1x2 Mode 水平)(单屏 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("3360x1050 @ 60Hz(1x2 Mode 水平)(单屏 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("3200x1200 @ 60Hz(1x2 Mode 水平)(单屏 1600x1200 @ 60Hz)"),	    /* mode 37 */
	_T("2880x900  @ 60Hz(1x2 Mode 水平)(单屏 1440x900  @ 60Hz)"),     /* mode 38 */
	_T("2800x1050 @ 75Hz(1x2 Mode 水平)(单屏 1400x1050 @ 75Hz)"),     /* mode 39 */
	_T("2800x1050 @ 60Hz(1x2 Mode 水平)(单屏 1400x1050 @ 60Hz)"),     /* mode 40 */
	_T("2732x768  @ 60Hz(1x2 Mode 水平)(单屏 1366x768  @ 60Hz)"),     /* mode 41 */
	_T("2720x768  @ 60Hz(1x2 Mode 水平)(单屏 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("2560x1024 @ 60Hz(1x2 Mode 水平)(单屏 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode 水平)(单屏 1280x1024 @ 75Hz)"),     /* mode 44 */
	_T("2560x1024 @ 85Hz(1x2 Mode 水平)(单屏 1280x1024 @ 85Hz)"),     /* mode 45 */
	_T("2560x960  @ 60Hz(1x2 Mode 水平)(单屏 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode 水平)(单屏 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode 水平)(单屏 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("2560x720  @ 50Hz(1x2 Mode 水平)(单屏 1280x720  @ 50Hz)"),     /* mode 49 */
	_T("2560x720  @ 60Hz(1x2 Mode 水平)(单屏 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("2048x768  @ 50Hz(1x2 Mode 水平)(单屏 1024x768  @ 50Hz)"),     /* mode 51 */
	_T("2048x768  @ 60Hz(1x2 Mode 水平)(单屏 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode 水平)(单屏 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode 水平)(单屏 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode 水平)(单屏 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode 水平)(单屏 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode 水平)(单屏 800x600   @ 85Hz)"),     /* mode 57 */

	// 1x1 单屏
	_T("1920x1200 @ 60Hz(1x1 Mode 单屏)"),	    /* mode 58*/
	_T("1920x1080 @ 60Hz(1x1 Mode 单屏)"),	    /* mode 59*/
	_T("1600x1200 @ 60Hz(1x1 Mode 单屏)"),       /* mode 60*/

#ifdef MV103_120HZ
	_T("1*1024x768  @ 120Hz"),	    /* mode add*/
	_T("2*1024x768  @ 120Hz"),	    /* mode add*/
	_T("3*1024x768  @ 120Hz")	    /* mode add*/
#endif

	_T("END"),
};

//-----------------------------------<<<  英文版 >>>----------------------------------------------------------
#else
CString m_MV103S_HDVE_PRO_strTimings[] = {
	// 1x3 Horizontal
	_T("5760x1080 @ 50Hz(1x3 Mode Horizontal)(Single-screen 1920x1080 @ 50Hz)"),     /* mode 27 : wide timing */
	_T("5040x1050 @ 60Hz(1x3 Mode Horizontal)(Single-screen 1680x1050 @ 60Hz)"),     /* mode 26 : wide timing */
	_T("4800x900  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1600x900  @ 60Hz)"),     /* mode 25 : wide timing */
	_T("4320x900  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1440x900  @ 60Hz)"),     /* mode 22 : wide timing */
	_T("4200x1050 @ 50Hz(1x3 Mode Horizontal)(Single-screen 1400x1050 @ 50Hz)"),     /* mode 23 : wide timing */
	_T("4200x1050 @ 60Hz(1x3 Mode Horizontal)(Single-screen 1400x1050 @ 60Hz)"),     /* mode 24 : wide timing */
	_T("4098x768  @ 50Hz(1x3 Mode Horizontal)(Single-screen 1366x768  @ 50Hz)"),     /* mode 20 : wide timing */
	_T("4098x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1366x768  @ 60Hz)"),     /* mode 21 : wide timing */
	_T("4080x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1360x768  @ 60Hz)"),     /* mode 19 */
	_T("3840x1024 @ 50Hz(1x3 Mode Horizontal)(Single-screen 1280x1024 @ 50Hz)"),     /* mode 0  */ 
	_T("3840x1024 @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 1  */ 
	_T("3840x960  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x960  @ 60Hz)"),     /* mode 2  */
	_T("3840x800  @ 50Hz(1x3 Mode Horizontal)(Single-screen 1280x800  @ 50Hz)"),     /* mode 3  */
	_T("3840x800  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x800  @ 60Hz)"),     /* mode 4  */
	_T("3840x800  @ 60Hz_FD(1x3 Mode Horizontal)(Single-screen 1280x800 @ 60Hz_FD)"),     /* mode 61*/
	_T("3840x800  @ 60Hz_RD(1x3 Mode Horizontal)(Single-screen 1280x800 @ 60Hz_RD)"),      /* mode 62*/  
	_T("3840x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x768  @ 60Hz)"),     /* mode 5  */
	_T("3840x720  @ 50Hz(1x3 Mode Horizontal)(Single-screen 1280x720  @ 50Hz)"),     /* mode 6  */
	_T("3840x720  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x720  @ 60Hz)"),     /* mode 7  */
	_T("3072x768  @ 50Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 50Hz)"),     /* mode 8  */
	_T("3072x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 60Hz)"),     /* mode 9  */
	_T("3072x768  @ 75Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 75Hz)"),     /* mode 10  */
	_T("3072x768  @ 85Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 85Hz)"),     /* mode 11 */
	_T("2400x600  @ 60Hz(1x3 Mode Horizontal)(Single-screen 800x600   @ 60Hz)"),     /* mode 12 */
	_T("2400x600  @ 75Hz(1x3 Mode Horizontal)(Single-screen 800x600   @ 75Hz)"),     /* mode 13 */
	_T("2400x600  @ 85Hz(1x3 Mode Horizontal)(Single-screen 800x600   @ 85Hz)"),     /* mode 14 */
	_T("2400x480  @ 60Hz(1x3 Mode Horizontal)(Single-screen 800x480   @ 60Hz)"),     /* mode 15 */
	_T("1920x480  @ 60Hz(1x3 Mode Horizontal)(Single-screen 640x480   @ 60Hz)"),     /* mode 16 */
	_T("1920x480  @ 75Hz(1x3 Mode Horizontal)(Single-screen 640x480   @ 75Hz)"),     /* mode 17 */
	_T("1920x480  @ 85Hz(1x3 Mode Horizontal)(Single-screen 640x480   @ 85Hz)"),     /* mode 18 */

	// 1x2 Horizontal
	_T("4096x1152 @ 60Hz(1x2 Mode Horizontal)(Single-screen 2048x1152 @ 60Hz)"),     /* mode 28 : wide timing */
	_T("4096x1080 @ 60Hz(1x2 Mode Horizontal)(Single-screen 2048x1080 @ 60Hz)"),     /* mode 29 : wide timing */
	_T("4096x1200 @ 60Hz(1x2 Mode Horizontal)(Single-screen 2048x1200 @ 60Hz)"),     /* mode 30 : wide timing */
	_T("4096x1080 @ 50Hz(1x2 Mode Horizontal)(Single-screen 2048x1080 @ 50Hz)"),     /* mode 31 : wide timing */
	_T("4096x1200 @ 50Hz(1x2 Mode Horizontal)(Single-screen 2048x1200 @ 50Hz)"),     /* mode 32 : wide timing */
	_T("3840x1200 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1920x1200 @ 60Hz)"),     /* mode 33 */
	_T("3840x1080 @ 50Hz(1x2 Mode Horizontal)(Single-screen 1920x1080 @ 50Hz)"),     /* mode 34 */
	_T("3840x1080 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("3360x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("3200x1200 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1600x1200 @ 60Hz)"),	    /* mode 37 */
	_T("2880x900  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1440x900  @ 60Hz)"),     /* mode 38 */
	_T("2800x1050 @ 75Hz(1x2 Mode Horizontal)(Single-screen 1400x1050 @ 75Hz)"),     /* mode 39 */
	_T("2800x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1400x1050 @ 60Hz)"),     /* mode 40 */
	_T("2732x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1366x768  @ 60Hz)"),     /* mode 41 */
	_T("2720x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("2560x1024 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 75Hz)"),     /* mode 44 */
	_T("2560x1024 @ 85Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 85Hz)"),     /* mode 45 */
	_T("2560x960  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("2560x720  @ 50Hz(1x2 Mode Horizontal)(Single-screen 1280x720  @ 50Hz)"),     /* mode 49 */
	_T("2560x720  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("2048x768  @ 50Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 50Hz)"),     /* mode 51 */
	_T("2048x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 85Hz)"),     /* mode 57 */

	// 1x1 单屏
	_T("1920x1200 @ 60Hz(1x1 Mode Single-screen)"),	    /* mode 58*/
	_T("1920x1080 @ 60Hz(1x1 Mode Single-screen)"),	    /* mode 59*/
	_T("1600x1200 @ 60Hz(1x1 Mode Single-screen)"),       /* mode 60*/

#ifdef MV103_120HZ
	_T("1*1024x768  @ 120Hz"),	    /* mode add*/
	_T("2*1024x768  @ 120Hz"),	    /* mode add*/
	_T("3*1024x768  @ 120Hz")	    /* mode add*/
#endif

	_T("END"),
};
#endif

TIMING_STRUCT MV103S_HDVE_PRO_detailed_timings[] ={
	//Fpixel  h_active  h_blank v_active  v_blank  h_front h_synct v_front  v_synct  h_size, v_size, h_pol, v_pol, h_border, v_border, Hz
	// 1x3 水平
	{32670,  5760,     48,      1080,     45,      16,     16,     4,        5,      5040,   1080,   1,     0,     0,        0,       50}, // 总5760x1080(1x3 水平)--单(1920x1080 @ 50Hz)(RDC, Non-RDC) - flv
	{32970,  5040,     48,      1050,     30,      16,     16,     3,        6,      5040,   1050,   1,     0,     0,        0,       60}, // 总5040x1050(1x3 水平)--单(1680x1050 @ 60Hz)(RDC)          - flv
	{31200,  4800,     786,     900,      32,      262,    262,    1,        3,      4800,   900,    1,     1,     0,        0,       60}, // 总4800x900 (1x3 水平)--单(1600x900  @ 60Hz)(Non-RDC)      - flv
	{26625,  4320,     480,     900,      26,      144,    96,     3,        6,      4320,   900,    1,     0,     0,        0,       60}, // 总4320x900 (1x3 水平)--单(1440x900  @ 60Hz)(RDC)	
	{25250,  4200,     480,     1050,     30,      144,    96,     3,        4,      4200,   1050,   1,     0,     0,        0,       50}, // 总4200x1050(1x3 水平)--单(1400x900  @ 50Hz) wide timings, reduce blank, 
	{30300,  4200,     480,     1050,     30,      144,    96,     3,        4,      4200,   1050,   1,     0,     0,        0,       60}, // 总4200x1050(1x3 水平)--单(1400x900  @ 60Hz) wide timings, reduce blank, 	
	{21375,  4098,     1278,    768,      27,      192,    336,    3,        6,      4098,   768,    1,     1,     0,        0,       50}, // 总4098x768 (1x3 水平)--单(1366x768  @ 50Hz) wide timings
	{25650,  4098,     1278,    768,      27,      192,    336,    3,        6,      4098,   768,    1,     1,     0,        0,       60}, // 总4098x768 (1x3 水平)--单(1366x768  @ 60Hz) wide timings	
	{25644,  4080,     1296,    768,      27,      192,    336,    3,        6,      4080,   768,    1,     1,     0,        0,       60}, // 总4080x768 (1x3 水平)--单(1360x768  @ 60Hz)
	{28350,  3840,     1200,    1024,     101,     120,    420,    1,        3,      3840,   1024,   1,     1,     0,        0,       50}, // 总3840x1024(1x3 水平)--单(1280x1024 @ 50Hz)  
	{32400,  3840,     1224,    1024,     42,      144,    336,    1,        3,      3840,   1024,   1,     1,     0,        0,       60}, // 总3840x1024(1x3 水平)--单(1280x1024 @ 60Hz) 
	{32400,  3840,     1560,    960,      40,      288,    336,    1,        3,      3840,   960,    1,     1,     0,        0,       60}, // 总3840x960 (1x3 水平)--单(1280x960  @ 60Hz) 
	{17777,  3840,     480,     800,      23,      144,    96,     3,        6,      3840,   800,    0,     1,     0,        0,       50}, // 总3840x800 (1x3 水平)--单(1280x800  @ 50Hz) 
	{25050,  3840,     1200,     800,     31,      216,    384,    3,        6,      3840,   800,    0,     1,     0,        0,       60}, // 总3840x800 (1x3 水平)--单(1280x800  @ 60Hz) 
	{21779,  3840,     528,     800,      31,      36,    192,     3,        3,      3840,   800,    0,     0,     0,        0,       60}, // 总3840x800 (1x3 水平)--单(1280x800  @ 60Hz_FD) 
	{21954,  3840,     480,     800,      47,      144,    96,     3,        6,      3840,   800,    1,     0,     0,        0,       60}, // 总3840x800 (1x3 水平)--单(1280x800  @ 60Hz_RD) 
	{20475,  3840,     480,     768,      22,      144,    96,     3,        7,      3840,   768,    1,     0,     0,        0,       60}, // 总3840x768 (1x3 水平)--单(1280x768  @ 60Hz) 
	{22275,  3840,     2100,    720,      30,      1320,   120,    5,        5,      3840,   720,    1,     1,     0,        0,       50}, // 总3840x720 (1x3 水平)--单(1280x720  @ 50Hz) 
	{22300,  3840,     1116,    720,      30,      330,    120,    5,        5,      3840,   720,    1,     1,     0,        0,       60}, // 总3840x720 (1x3 水平)--单(1280x720  @ 60Hz)(DP)
	{15567,  3072,     864,     768,      23,      120,    312,    1,        3,      3072,   768,    0,     1,     0,        0,       50}, // 总3072x768 (1x3 水平)--单(1024x768  @ 50Hz) 
	{19500,  3072,     960,     768,      38,      72,     408,    3,        6,      3072,   768,    0,     0,     0,        0,       60}, // 总3072x768 (1x3 水平)--单(1024x768  @ 60Hz) 
	{23625,  3072,     864,     768,      32,      48,     288,    1,        3,      3072,   768,    1,     1,     0,        0,       75}, // 总3072x768 (1x3 水平)--单(1024x768  @ 75Hz) 
	{28350,  3072,     1056,    768,      40,      192,    288,    1,        3,      3072,   768,    1,     1,     0,        0,       85}, // 总3072x768 (1x3 水平)--单(1024x768  @ 85Hz) 
	{12000,  2400,     768,     600,      28,      120,    384,    1,        4,      2400,   600,    1,     1,     0,        0,       60}, // 总2400x600 (1x3 水平)--单(800x600   @ 60Hz) 
	{14850,  2400,     768,     600,      25,      48,     240,    1,        3,      2400,   600,    1,     1,     0,        0,       75}, // 总2400x600 (1x3 水平)--单(800x600   @ 75Hz) 
	{16875,  2400,     744,     600,      31,      96,     192,    1,        3,      2400,   600,    1,     1,     0,        0,       85}, // 总2400x600 (1x3 水平)--单(800x600   @ 85Hz) 
	{10030,  2400,     768,     480,      45,      144,    384,    10,       2,      2400,   480,    0,     0,     0,        0,       60}, // 总2400x480 (1x3 水平)--单(800x480   @ 60Hz) 
	{7553,   1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       60}, // 总1920x480 (1x3 水平)--单(640x480   @ 60Hz) 
	{9440,   1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       75}, // 总1920x480 (1x3 水平)--单(640x480   @ 75Hz) 
	{10700,  1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       85}, // 总1920x480 (1x3 水平)--单(640x480   @ 85Hz) 


	// 1x2 水平
	{31360,  4096,     320,     1152,     33,      96,     64,     3,        5,      4096,   1152,   1,     0,     0,        0,       60}, // 总4096x1152(1x2 水平)--单(2048x1152 @ 60Hz) wide timings	
	{29304,  4096,     320,     1080,     26,      96,     64,     3,        10,     4096,   1080,   1,     1,     0,        0,       60}, // 总4096x1080(1x2 水平)--单(2048x1080 @ 60Hz) wide timings
	{32484,  4096,     320,     1200,     26,      96,     64,     3,        5,      4096,   1200,   1,     0,     0,        0,       60}, // 总4096x1200(1x2 水平)--单(2048x1200 @ 60Hz) wide timings, mviewtech properitary timing
	{24420,  4096,     320,     1080,     26,      96,     64,     3,        10,     4096,   1080,   1,     1,     0,        0,       50}, // 总4096x1080(1x2 水平)--单(2048x1080 @ 50Hz) wide timings
	{27070,  4096,     320,     1200,     26,      96,     64,     3,        5,      4096,   1200,   1,     0,     0,        0,       50}, // 总4096x1200(1x2 水平)--单(2048x1200 @ 50Hz) wide timings, mviewtech properitary timing
	{30800,  3840,     320,     1200,     35,      96,     64,     3,        6,      3840,   1200,   1,     0,     0,        0,       60}, // 总3840x1200(1x2 水平)--单(1920x1200 @ 60Hz)
	{24750,  3840,     560,     1080,     45,      176,    88,     4,        5,      3840,   1080,   1,     1,     0,        0,       50}, // 总3840x1080(1x2 水平)--单(1920x1080 @ 50Hz) low pixel rate
	{29700,  3840,     560,     1080,     45,      176,    88,     4,        5,      3840,   1080,   1,     1,     0,        0,       60}, // 总3840x1080(1x2 水平)--单(1920x1080 @ 60Hz)
	{23800,  3360,     320,     1050,     30,      96,     64,     3,        6,      3360,   1050,   1,     0,     0,        0,       60}, // 总3360x1050(1x2 水平)--单(1680x1050 @ 60Hz)
	{32400,  3200,     1120,    1200,     50,      128,    384,    1,        3,      3200,   1200,   1,     1,     0,        0,       60}, // 总3200x1200(1x2 水平)--单(1600x1200 @ 60Hz)
	{17750,  2880,     320,     900,      26,      96,     64,     3,        6,      2880,   900,    1,     0,     0,        0,       60}, // 总2880x900 (1x2 水平)--单(1440x900  @ 60Hz)
	{25272,  2800,     320,     1050,     30,      96,     64,     3,        4,      2800,   1050,   1,     0,     0,        0,       75}, // 总2800x1050(1x2 水平)--单(1400x1050 @ 75Hz)
	{20200,  2800,     320,     1050,     30,      96,     64,     3,        4,      2800,   1050,   1,     0,     0,        0,       60}, // 总2800x1050(1x2 水平)--单(1400x1050 @ 60Hz)
	{14400,  2732,     268,     768,      32,      28,     112,    1,        3,      2732,   768,    1,     1,     0,        0,       60}, // 总2732x768 (1x2 水平)--单(1366x768  @ 60Hz)
	{17100,  2720,     864,     768,      27,      128,    224,    3,        6,      2720,   768,    1,     1,     0,        0,       60}, // 总2720x768 (1x2 水平)--单(1360x768  @ 60Hz)
	{21600,  2560,     816,     1024,     42,      96,     224,    1,        3,      2560,   1024,   1,     1,     0,        0,       60}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 60Hz)
	{27000,  2560,     816,     1024,     42,      32,     288,    1,        3,      2560,   1024,   1,     1,     0,        0,       75}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 75Hz)
	{30600,  2560,     816,     1024,     42,      32,     288,    1,        3,      2560,   1024,   1,     1,     0,        0,       85}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 85Hz)
	{21600,  2560,     1040,    960,      40,      192,    224,    1,        3,      2560,   960,    1,     1,     0,        0,       60}, // 总2560x900 (1x2 水平)--单(1280x900  @ 60Hz)
	{16700,  2560,     800,     800,      31,      144,    256,    3,        6,      2560,   800,    0,     1,     0,        0,       60}, // 总2560x800 (1x2 水平)--单(1280x800  @ 60Hz)
	{13650,  2560,     320,     768,      22,      96,     64,     3,        7,      2560,   768,    1,     0,     0,        0,       60}, // 总2560x768 (1x2 水平)--单(1280x768  @ 60Hz)
	{14850,  2560,     1400,    720,      30,      880,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       50}, // 总2560x720 (1x2 水平)--单(1280x720  @ 50Hz)
	{14850,  2560,     740,     720,      30,      220,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       60}, // 总2560x720 (1x2 水平)--单(1280x720  @ 60Hz)
	{10378,  2048,     576,     768,      23,      80,     208,    1,        3,      2048,   768,    0,     1,     0,        0,       50}, // 总2048x768 (1x2 水平)--单(1024x768  @ 50Hz)
	{13000,  2048,     640,     768,      38,      48,     272,    3,        6,      2048,   768,    0,     0,     0,        0,       60}, // 总2048x768 (1x2 水平)--单(1024x768  @ 60Hz)
	{15750,  2048,     576,     768,      32,      32,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       75}, // 总2048x768 (1x2 水平)--单(1024x768  @ 75Hz)
	{18900,  2048,     704,     768,      40,      96,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       85}, // 总2048x768 (1x2 水平)--单(1024x768  @ 85Hz)
	{8000,   1600,     512,     600,      28,      80,     256,    1,        4,      1600,   600,    1,     1,     0,        0,       60}, // 总1600x600 (1x2 水平)--单(800x600   @ 60Hz)
	{9900,   1600,     512,     600,      25,      32,     160,    1,        3,      1600,   600,    1,     1,     0,        0,       75}, // 总1600x600 (1x2 水平)--单(800x600   @ 75Hz)
	{11250,  1600,     496,     600,      31,      64,     128,    1,        3,      1600,   600,    1,     1,     0,        0,       85}, // 总1600x600 (1x2 水平)--单(800x600   @ 85Hz)

	// 1x1 单屏
	{15400,  1920,     160,     1200,     35,      48,     32 ,    3,        6,      1920,   1200,   1,     0,     0,        0,       60}, // 总1920x1200(1x1 水平)--单(1920x1200 @ 60Hz)
	{14850,  1920,     280,     1080,     45,      88,     44 ,    4,        5,      1920,   1080,   1,     1,     0,        0,       60}, // 总1920x1080(1x1 水平)--单(1920x1080 @ 60Hz)
	{13412,  1600,     160,     1200,     71,      48,     32,     3,        4,      1600,   1200,   1,     0,     0,        0,       60}, // 总1600x1200(1x1 水平)--单(1600x1200 @ 60Hz) reduced blank from 120Hz version

#ifdef MV103_120HZ
	{13000,  1024,     320,     768,      38,      24,     136,    3,        6,      1024,   768,    0,     0,     0,        0,       120}, // 总1024x768 (1x1 水平)--单(1024x768  @ 120Hz)
	{26000,  2048,     640,     768,      38,      48,     272,    3,        6,      2048,   768,    0,     0,     0,        0,       120}, // 总2048x768 (1x2 水平)--单(1024x768  @ 120Hz)
	{32380,  3072,     276,     768,      38,      48,     48,     3,        6,      3072,   768,    0,     0,     0,        0,       120}  // 总3072x768 (1x3 水平)--单(1024x768  @ 120Hz) 
#endif
};

//------------------------------- END -----------------------------------------------/


/***************************** MV103S_HDVE *****************************************/
//-----------------------------------<<< 中文版 >>>-----------------------------------------------------------
#ifndef ENGLISHVER
CString m_MV103S_HDVE_strTimings[] = {
	// 1x3 水平
	_T("4320x900  @ 60Hz(1x3 Mode 水平)(单屏 1440x900  @ 60Hz)"),     /* mode 0* wide timing */
	_T("4098x768  @ 60Hz(1x3 Mode 水平)(单屏 1366x768  @ 60Hz)"),     /* mode 1* wide timing */
	_T("4080x768  @ 60Hz(1x3 Mode 水平)(单屏 1360x768  @ 60Hz)"),     /* mode 2*/
	_T("3840x1024 @ 60Hz(1x3 Mode 水平)(单屏 1280x1024 @ 60Hz)"),    /* mode 3 */ 
	_T("3840x960  @ 60Hz(1x3 Mode 水平)(单屏 1280x960  @ 60Hz)"),     /* mode 4 */
	_T("3840x800  @ 60Hz(1x3 Mode 水平)(单屏 1280x800  @ 60Hz)"),     /* mode 5 */
	_T("3840x768  @ 60Hz(1x3 Mode 水平)(单屏 1280x768  @ 60Hz)"),     /* mode 6 */
	_T("3840x720  @ 60Hz(1x3 Mode 水平)(单屏 1280x720  @ 60Hz)"),     /* mode 7 */
	_T("3072x768  @ 60Hz(1x3 Mode 水平)(单屏 1024x768  @ 60Hz)"),     /* mode 8 */
	_T("3072x768  @ 75Hz(1x3 Mode 水平)(单屏 1024x768  @ 75Hz)"),     /* mode 9 */
	_T("3072x768  @ 85Hz(1x3 Mode 水平)(单屏 1024x768  @ 85Hz)"),     /* mode 10 */
	_T("2400x600  @ 60Hz(1x3 Mode 水平)(单屏 800x600   @ 60Hz)"),     /* mode 12 */
	_T("2400x600  @ 75Hz(1x3 Mode 水平)(单屏 800x600   @ 75Hz)"),     /* mode 13 */
	_T("2400x600  @ 85Hz(1x3 Mode 水平)(单屏 800x600   @ 85Hz)"),     /* mode 14 */
	_T("2400x480  @ 60Hz(1x3 Mode 水平)(单屏 800x480   @ 60Hz)"),     /* mode 15 */
	_T("1920x480  @ 60Hz(1x3 Mode 水平)(单屏 640x480   @ 60Hz)"),     /* mode 16 */
	_T("1920x480  @ 75Hz(1x3 Mode 水平)(单屏 640x480   @ 75Hz)"),     /* mode 17 */
	_T("1920x480  @ 85Hz(1x3 Mode 水平)(单屏 640x480   @ 85Hz)"),      /* mode 17*/

	// 1x2 水平
	_T("4096x1152 @ 60Hz(1x2 Mode 水平)(单屏 2048x1152 @ 60Hz)"),    /* mode 18 * wide timing */
	_T("3840x1200 @ 60Hz(1x2 Mode 水平)(单屏 1920x1200 @ 60Hz)"),    /* mode 19 */
	_T("3840x1080 @ 60Hz(1x2 Mode 水平)(单屏 1920x1080 @ 60Hz)"),    /* mode 20 */
	_T("3360x1050 @ 60Hz(1x2 Mode 水平)(单屏 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("3200x1200 @ 60Hz(1x2 Mode 水平)(单屏 1600x1200 @ 60Hz)"),	    /* mode 37 */
	_T("2880x900  @ 60Hz(1x2 Mode 水平)(单屏 1440x900  @ 60Hz)"),     /* mode 23 */
	_T("2800x1050 @ 60Hz(1x2 Mode 水平)(单屏 1400x1050 @ 60Hz)"),     /* mode 23a */
	_T("2732x768  @ 60Hz(1x2 Mode 水平)(单屏 1366x768  @ 60Hz)"),     /* mode 41 */
	_T("2720x768  @ 60Hz(1x2 Mode 水平)(单屏 1360x768  @ 60Hz)"),     /* mode 25 */
	_T("2560x1024 @ 60Hz(1x2 Mode 水平)(单屏 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode 水平)(单屏 1280x1024 @ 75Hz)"),    /* mode 27 */
	_T("2560x960  @ 60Hz(1x2 Mode 水平)(单屏 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode 水平)(单屏 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode 水平)(单屏 1280x768  @ 60Hz)"),     /* mode 30 */
	_T("2560x720  @ 60Hz(1x2 Mode 水平)(单屏 1280x720  @ 60Hz)"),     /* mode 31 */
	_T("2048x768  @ 60Hz(1x2 Mode 水平)(单屏 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode 水平)(单屏 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode 水平)(单屏 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode 水平)(单屏 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode 水平)(单屏 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode 水平)(单屏 800x600   @ 85Hz)"),      /* mode 37 */

	// 1x1 单屏
	_T("1920x1200 @ 60Hz(1x1 Mode 单屏)"),	   /* mode 35*/
	_T("1920x1080 @ 60Hz(1x1 Mode 单屏)"),	   /* mode 39*/
	_T("1600x1200 @ 60Hz(1x1 Mode 单屏)"),    /* mode 40*/

	_T("END"),
};

//-----------------------------------<<<  英文版 >>>----------------------------------------------------------
#else
CString m_MV103S_HDVE_strTimings[] = {
	// 1x3 Horizontal
	_T("4320x900  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1440x900  @ 60Hz)"),     /* mode 0* wide timing */
	_T("4098x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1366x768  @ 60Hz)"),     /* mode 1* wide timing */
	_T("4080x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1360x768  @ 60Hz)"),     /* mode 2*/
	_T("3840x1024 @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),    /* mode 3 */ 
	_T("3840x960  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x960  @ 60Hz)"),     /* mode 4 */
	_T("3840x800  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x800  @ 60Hz)"),     /* mode 5 */
	_T("3840x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x768  @ 60Hz)"),     /* mode 6 */
	_T("3840x720  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1280x720  @ 60Hz)"),     /* mode 7 */
	_T("3072x768  @ 60Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 60Hz)"),     /* mode 8 */
	_T("3072x768  @ 75Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 75Hz)"),     /* mode 9 */
	_T("3072x768  @ 85Hz(1x3 Mode Horizontal)(Single-screen 1024x768  @ 85Hz)"),     /* mode 10 */
	_T("2400x600  @ 60Hz(1x3 Mode Horizontal)(Single-screen 800x600   @ 60Hz)"),     /* mode 12 */
	_T("2400x600  @ 75Hz(1x3 Mode Horizontal)(Single-screen 800x600   @ 75Hz)"),     /* mode 13 */
	_T("2400x600  @ 85Hz(1x3 Mode Horizontal)(Single-screen 800x600   @ 85Hz)"),     /* mode 14 */
	_T("2400x480  @ 60Hz(1x3 Mode Horizontal)(Single-screen 800x480   @ 60Hz)"),     /* mode 15 */
	_T("1920x480  @ 60Hz(1x3 Mode Horizontal)(Single-screen 640x480   @ 60Hz)"),     /* mode 16 */
	_T("1920x480  @ 75Hz(1x3 Mode Horizontal)(Single-screen 640x480   @ 75Hz)"),     /* mode 17 */
	_T("1920x480  @ 85Hz(1x3 Mode Horizontal)(Single-screen 640x480   @ 85Hz)"),      /* mode 17*/

	// 1x2 Horizontal
	_T("4096x1152 @ 60Hz(1x2 Mode Horizontal)(Single-screen 2048x1152 @ 60Hz)"),    /* mode 18 * wide timing */
	_T("3840x1200 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1920x1200 @ 60Hz)"),    /* mode 19 */
	_T("3840x1080 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1920x1080 @ 60Hz)"),    /* mode 20 */
	_T("3360x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("3200x1200 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1600x1200 @ 60Hz)"),	    /* mode 37 */
	_T("2880x900  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1440x900  @ 60Hz)"),     /* mode 23 */
	_T("2800x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1400x1050 @ 60Hz)"),     /* mode 23a */
	_T("2732x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1366x768  @ 60Hz)"),     /* mode 41 */
	_T("2720x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1360x768  @ 60Hz)"),     /* mode 25 */
	_T("2560x1024 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 75Hz)"),    /* mode 27 */
	_T("2560x960  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x768  @ 60Hz)"),     /* mode 30 */
	_T("2560x720  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x720  @ 60Hz)"),     /* mode 31 */
	_T("2048x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 85Hz)"),      /* mode 37 */

	// 1x1 单屏
	_T("1920x1200 @ 60Hz(1x1 Mode Single-screen)"),	   /* mode 35*/
	_T("1920x1080 @ 60Hz(1x1 Mode Single-screen)"),	   /* mode 39*/
	_T("1600x1200 @ 60Hz(1x1 Mode Single-screen)"),    /* mode 40*/

	_T("END"),
};
#endif

TIMING_STRUCT MV103S_HDVE_detailed_timings[] ={
	//Fpixel h_active h_blank v_active  v_blank  h_front h_synct v_front  v_synct  h_size, v_size, h_pol, v_pol, h_border, v_border,  Hz
	// 1x3 水平
	{26625, 4320,     480,     900,      26,      144,    96,     3,        6,      4320,   900,    1,     0,     0,        0,       60}, // 总4320x900 (1x3 水平)--单(1440x900  @ 60Hz)
	{25650, 4098,	  1278,    768,      27,      192,    336,    3,        6,      4098,   768,    1,     1,     0,        0,       60}, // 总4096x768 (1x3 水平)--单(1366x768  @ 60Hz)
	{25644, 4080,     1296,    768,      27,      192,    336,    3,        6,      4080,   768,    1,     1,     0,        0,       60}, // 总4080x768 (1x3 水平)--单(1360x768  @ 60Hz)
	{32400, 3840,     1224,    1024,     42,      144,    336,    1,        3,      3840,   1024,   1,     1,     0,        0,       60}, // 总3840x1024(1x3 水平)--单(1280x1024 @ 60Hz)
	{32400, 3840,     1560,    960,      40,      288,    336,    1,        3,      3840,   960,    1,     1,     0,        0,       60}, // 总3840x960 (1x3 水平)--单(1280x960  @ 60Hz)
	{21300, 3840,     480,     800,      23,      144,    96,     3,        6,      3840,   800,    0,     1,     0,        0,       60}, // 总3840x800 (1x3 水平)--单(1280x800  @ 60Hz)
	{20475, 3840,     480,     768,      22,      144,    96,     3,        7,      3840,   768,    1,     0,     0,        0,       60}, // 总3840x768 (1x3 水平)--单(1280x768  @ 60Hz)
	{22300, 3840,     1116,    720,      30,      330,    120,    5,        5,      3840,   720,    1,     1,     0,        0,       60}, // 总3840x720 (1x3 水平)--单(1280x720  @ 60Hz)
	{19500, 3072,     960,     768,      38,      72,     408,    3,        6,      3072,   768,    0,     0,     0,        0,       60}, // 总3072x768 (1x3 水平)--单(1024x768  @ 60Hz)
	{23625, 3072,     864,     768,      32,      48,     288,    1,        3,      3072,   768,    1,     1,     0,        0,       75}, // 总3072x768 (1x3 水平)--单(1024x768  @ 75Hz)
	{28350, 3072,     1056,    768,      40,      192,    288,    1,        3,      3072,   768,    1,     1,     0,        0,       85}, // 总3072x768 (1x3 水平)--单(1024x768  @ 85Hz)
	{12000, 2400,     768,     600,      28,      120,    384,    1,        4,      2400,   600,    1,     1,     0,        0,       60}, // 总2400x600 (1x3 水平)--单(800x600   @ 60Hz)
	{14850, 2400,     768,     600,      25,      48,     240,    1,        3,      2400,   600,    1,     1,     0,        0,       75}, // 总2400x600 (1x3 水平)--单(800x600   @ 75Hz)
	{16875, 2400,     744,     600,      31,      96,     192,    1,        3,      2400,   600,    1,     1,     0,        0,       85}, // 总2400x600 (1x3 水平)--单(800x600   @ 85Hz)
	{10030, 2400,     768,     480,      45,      144,    384,    10,       2,      2400,   480,    0,     0,     0,        0,       60}, // 总2400x480 (1x3 水平)--单(800x480   @ 60Hz)
	{7553,  1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       60}, // 总1920x480 (1x3 水平)--单(640x480   @ 60Hz)
	{9441,  1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       75}, // 总1920x480 (1x3 水平)--单(640x480   @ 75Hz)
	{10700, 1920,     432,     480,      29,      24,     288,    2,        2,      1920,   480,    0,     0,     0,        0,       85}, // 总1920x480 (1x3 水平)--单(640x480   @ 85Hz)

	// 1x2 水平
	{31360, 4096,     320,     1152,     33,      96,     64,     3,        5,      4096,   1152,   1,     0,     0,        0,       60}, // 总4096x1152(1x2 水平)--单(2048x1152 @ 60Hz)
	{30800, 3840,     320,     1200,     35,      96,     64,     3,        6,      3840,   1200,   1,     0,     0,        0,       60}, // 总3840x1200(1x2 水平)--单(1920x1200 @ 60Hz)
	{29700, 3840,     560,     1080,     45,      176,    88,     4,        5,      3840,   1080,   1,     1,     0,        0,       60}, // 总3840x1080(1x2 水平)--单(1920x1080 @ 60Hz)
	{23800, 3360,     320,     1050,     30,      96,     64,     3,        6,      3360,   1050,   1,     0,     0,        0,       60}, // 总3360x1050(1x2 水平)--单(1680x1050 @ 60Hz)
	{32400, 3200,     1120,    1200,     50,      128,   384,     1,        3,      3200,   1200,   1,     1,     0,        0,       60}, // 总3200x1200(1x2 水平)--单(1600x1200 @ 60Hz)
	{17750, 2880,     320,     900,      26,      96,     64,     3,        6,      2880,   900,    1,     0,     0,        0,       60}, // 总2800x900 (1x2 水平)--单(1400x900  @ 60Hz)
	{20200, 2800,     320,     1050,     30,      96,     64,     3,        4,      2800,   1050,   1,     0,     0,        0,       60}, // 总2800x1050(1x2 水平)--单(1400x1050 @ 60Hz) 
	{14400, 2732,     268,     768,      32,      28,     112,    1,        3,      2732,   768,    1,     1,     0,        0,       60}, // 总2732x768 (1x2 水平)--单(1366x768  @ 60Hz)
	{17100, 2720,     864,     768,      27,      128,    224,    3,        6,      2720,   768,    1,     1,     0,        0,       60}, // 总2720x768 (1x2 水平)--单(1360x768  @ 60Hz)
	{21600, 2560,     816,     1024,     42,      96,     224,    1,        3,      2560,   1024,   1,     1,     0,        0,       60}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 60Hz)
	{27000, 2560,     816,     1024,     42,      32,     288,    1,        3,      2560,   1024,   1,     1,     0,        0,       75}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 75Hz)
	{21600, 2560,     1040,    960,      40,      192,    224,    1,        3,      2560,   960,    1,     1,     0,        0,       60}, // 总2560x960 (1x2 水平)--单(1280x960  @ 60Hz)
	{16700, 2560,     800,     800,      31,      144,    256,    3,        6,      2560,   800,    0,     1,     0,        0,       60}, // 总2560x800 (1x2 水平)--单(1280x800  @ 60Hz)
	//	{21300, 2560,     832,     800,      38,      160,    256,    3,        6,      2560,   800,    0,     1,     0,        0,       75}, // 总2560x800 (1x2 水平)--单(1280x800  @ 75Hz)
	{13650, 2560,     320,     768,      22,      96,     64,     3,        7,      2560,   768,    1,     0,     0,        0,       60}, // 总2560x768 (1x2 水平)--单(1280x768  @ 60Hz)
	{14850, 2560,     740,     720,      30,      220,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       60}, // 总2560x720 (1x2 水平)--单(1280x720  @ 60Hz)
	{13000, 2048,     640,     768,      38,      48,     272,    3,        6,      2048,   768,    0,     0,     0,        0,       60}, // 总2048x768 (1x2 水平)--单(2048x768  @ 60Hz)
	{15750, 2048,     576,     768,      32,      32,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       75}, // 总2048x768 (1x2 水平)--单(2048x768  @ 75Hz)
	{18900, 2048,     704,     768,      40,      96,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       85}, // 总2048x768 (1x2 水平)--单(2048x768  @ 85Hz)
	{8000,  1600,     512,     600,      28,      80,     256,    1,        4,      1600,   600,    1,     1,     0,        0,       60}, // 总1600x600 (1x2 水平)--单(1600x600  @ 60Hz)
	{9900,  1600,     512,     600,      25,      32,     160,    1,        3,      1600,   600,    1,     1,     0,        0,       75}, // 总1600x600 (1x2 水平)--单(1600x600  @ 75Hz)
	{11250, 1600,     496,     600,      31,      64,     128,    1,        3,      1600,   600,    1,     1,     0,        0,       85}, // 总1600x600 (1x2 水平)--单(1600x600  @ 85Hz)

	// 1x1 单屏
	{15400, 1920,     160,     1200,     35,      48,     32 ,    3,        6,      1920,   1200,   1,     0,     0,        0,       60}, // 总1920x1200(1x1 水平)--单(1920x1200 @ 60Hz)
	{14850, 1920,     280,     1080,     45,      88,     44,     4,        5,      1920,   1080,   1,     1,     0,        0,       60}, // 总1920x1080(1x1 水平)--单(1920x1080 @ 60Hz)
	{13412, 1600,     160,     1200,     71,      48,     32,     3,        4,      1600,   1200,   1,     0,     0,        0,       60}, // 总1600x1200(1x1 水平)--单(1600x1200 @ 60Hz)
};
//------------------------------------------------------------------------------------/


/***************************** MV302_HDMI *****************************************/
//- MV302_HDMI  HDMI输入的两屏宝  支持297M以下的所有分辨率， 且为非宽屏分辨率 
//-----------------------------------<<< 中文版 >>>-----------------------------------------------------------
#ifndef ENGLISHVER
CString m_MV102_HDMI_strTimings[] = {  
	// 1x2 水平
	//_T("4096x1152 @ 60Hz(1x2 Mode 水平)(单屏 2048x1152 @ 60Hz)"),     /* mode 28 : wide timing */
	//_T("4096x1080 @ 60Hz(1x2 Mode 水平)(单屏 2048x1080 @ 60Hz)"),     /* mode 29 : wide timing */
	//_T("4096x1200 @ 60Hz(1x2 Mode 水平)(单屏 2048x1200 @ 60Hz)"),     /* mode 30 : wide timing */
	//_T("4096x1080 @ 50Hz(1x2 Mode 水平)(单屏 2048x1080 @ 50Hz)"),     /* mode 31 : wide timing */
	//_T("4096x1200 @ 50Hz(1x2 Mode 水平)(单屏 2048x1200 @ 50Hz)"),     /* mode 32 : wide timing */
	_T("3840x1200 @ 50Hz(1x2 Mode 水平)(单屏 1920x1200 @ 50Hz)"),     /* mode 33 */
	_T("3840x1080 @ 50Hz(1x2 Mode 水平)(单屏 1920x1080 @ 50Hz)"),     /* mode 34 */
	_T("3840x1080 @ 60Hz(1x2 Mode 水平)(单屏 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("3360x1050 @ 60Hz(1x2 Mode 水平)(单屏 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("3200x1200 @ 50Hz(1x2 Mode 水平)(单屏 1600x1200 @ 50Hz)"),	  /* mode 37 */
	_T("2880x900  @ 60Hz(1x2 Mode 水平)(单屏 1440x900  @ 60Hz)"),     /* mode 38 */
	_T("2800x1050 @ 75Hz(1x2 Mode 水平)(单屏 1400x1050 @ 75Hz)"),     /* mode 39 */
	_T("2800x1050 @ 60Hz(1x2 Mode 水平)(单屏 1400x1050 @ 60Hz)"),     /* mode 40 */
	//_T("2732x768  @ 60Hz(1x2 Mode 水平)(单屏 1366x768  @ 60Hz)"),     /* mode 41 */
	//_T("2720x768  @ 60Hz(1x2 Mode 水平)(单屏 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("2560x1024 @ 60Hz(1x2 Mode 水平)(单屏 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode 水平)(单屏 1280x1024 @ 75Hz)"),     /* mode 44 */
	//_T("2560x1024 @ 85Hz(1x2 Mode 水平)(单屏 1280x1024 @ 85Hz)"),     /* mode 45 */
	_T("2560x960  @ 60Hz(1x2 Mode 水平)(单屏 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode 水平)(单屏 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode 水平)(单屏 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("2560x720  @ 50Hz(1x2 Mode 水平)(单屏 1280x720  @ 50Hz)"),     /* mode 49 */
	_T("2560x720  @ 60Hz(1x2 Mode 水平)(单屏 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("2048x768  @ 50Hz(1x2 Mode 水平)(单屏 1024x768  @ 50Hz)"),     /* mode 51 */
	_T("2048x768  @ 60Hz(1x2 Mode 水平)(单屏 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode 水平)(单屏 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode 水平)(单屏 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600  @ 60Hz(1x2 Mode 水平)(单屏 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600  @ 75Hz(1x2 Mode 水平)(单屏 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600  @ 85Hz(1x2 Mode 水平)(单屏 800x600   @ 85Hz)"),     /* mode 57 */

	// 1x1 单屏
	_T("1920x1200 @ 60Hz(1x1 Mode 单屏)"),	  /* mode 58*/
	_T("1920x1080 @ 60Hz(1x1 Mode 单屏)"),	  /* mode 59*/
	_T("1600x1200 @ 60Hz(1x1 Mode 单屏)"),     /* mode 60*/
	//_T("3*1280x800@60Hz_FD  "),     /* mode 61*/
	//_T("3*1280x800@60Hz_RD  "),     /* mode 62*/  

	//_T("1*1024x768@120Hz"),	    /* mode add*/
	//_T("2*1024x768@120Hz"),	    /* mode add*/
	//_T("3*1024x768@120Hz")	    /* mode add*/

	_T("END"),
};

//-----------------------------------<<<  英文版 >>>----------------------------------------------------------
#else
CString m_MV102_HDMI_strTimings[] = {  
	// 1x2 Horizontal
	//_T("4096x1152 @ 60Hz(1x2 Mode Horizontal)(Single-screen 2048x1152 @ 60Hz)"),     /* mode 28 : wide timing */
	//_T("4096x1080 @ 60Hz(1x2 Mode Horizontal)(Single-screen 2048x1080 @ 60Hz)"),     /* mode 29 : wide timing */
	//_T("4096x1200 @ 60Hz(1x2 Mode Horizontal)(Single-screen 2048x1200 @ 60Hz)"),     /* mode 30 : wide timing */
	//_T("4096x1080 @ 50Hz(1x2 Mode Horizontal)(Single-screen 2048x1080 @ 50Hz)"),     /* mode 31 : wide timing */
	//_T("4096x1200 @ 50Hz(1x2 Mode Horizontal)(Single-screen 2048x1200 @ 50Hz)"),     /* mode 32 : wide timing */
	_T("3840x1200 @ 50Hz(1x2 Mode Horizontal)(Single-screen 1920x1200 @ 50Hz)"),     /* mode 33 */
	_T("3840x1080 @ 50Hz(1x2 Mode Horizontal)(Single-screen 1920x1080 @ 50Hz)"),     /* mode 34 */
	_T("3840x1080 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1920x1080 @ 60Hz)"),     /* mode 35 */
	_T("3360x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1680x1050 @ 60Hz)"),     /* mode 36 */
	_T("3200x1200 @ 50Hz(1x2 Mode Horizontal)(Single-screen 1600x1200 @ 50Hz)"),	  /* mode 37 */
	_T("2880x900  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1440x900  @ 60Hz)"),     /* mode 38 */
	_T("2800x1050 @ 75Hz(1x2 Mode Horizontal)(Single-screen 1400x1050 @ 75Hz)"),     /* mode 39 */
	_T("2800x1050 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1400x1050 @ 60Hz)"),     /* mode 40 */
	//_T("2732x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1366x768  @ 60Hz)"),     /* mode 41 */
	//_T("2720x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1360x768  @ 60Hz)"),     /* mode 42 */
	_T("2560x1024 @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 60Hz)"),     /* mode 43 */
	_T("2560x1024 @ 75Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 75Hz)"),     /* mode 44 */
	//_T("2560x1024 @ 85Hz(1x2 Mode Horizontal)(Single-screen 1280x1024 @ 85Hz)"),     /* mode 45 */
	_T("2560x960  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x960  @ 60Hz)"),     /* mode 46 */
	_T("2560x800  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("2560x720  @ 50Hz(1x2 Mode Horizontal)(Single-screen 1280x720  @ 50Hz)"),     /* mode 49 */
	_T("2560x720  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("2048x768  @ 50Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 50Hz)"),     /* mode 51 */
	_T("2048x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 60Hz)"),     /* mode 52 */
	_T("2048x768  @ 75Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 75Hz)"),     /* mode 53 */
	_T("2048x768  @ 85Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 85Hz)"),     /* mode 54 */
	_T("1600x600 @ 60Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 60Hz)"),     /* mode 55 */
	_T("1600x600 @ 75Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 75Hz)"),     /* mode 56 */
	_T("1600x600 @ 85Hz(1x2 Mode Horizontal)(Single-screen 800x600   @ 85Hz)"),     /* mode 57 */

	// 1x1 单屏
	_T("1920x1200 @ 60Hz(1x1 Mode Single-screen)"),	  /* mode 58*/
	_T("1920x1080 @ 60Hz(1x1 Mode Single-screen)"),	  /* mode 59*/
	_T("1600x1200 @ 60Hz(1x1 Mode Single-screen)"),     /* mode 60*/
	//_T("3*1280x800@60Hz_FD  "),     /* mode 61*/
	//_T("3*1280x800@60Hz_RD  "),     /* mode 62*/  

	//_T("1*1024x768@120Hz"),	    /* mode add*/
	//_T("2*1024x768@120Hz"),	    /* mode add*/
	//_T("3*1024x768@120Hz")	    /* mode add*/

	_T("END"),
};
#endif

TIMING_STRUCT MV102_HDMI_detailed_timings[] ={
	//Fpixel h_active h_blank v_active  v_blank h_front h_synct v_front  v_synct  h_size, v_size, h_pol, v_pol, h_border,v_border, Hz

	// 1x2 水平
	//{31360, 4096,     320,     1152,     33,      96,     64,     3,        5,      4096,   1152,   1,     0,     0,      0,       60}, // 总4096x1152(1x2 水平)--单(2048x1152 @ 60Hz) wide timings

	//{29304,  4096,    320,     1080,     26,      96,     64,     3,        10,     4096,   1080,   1,     1,     0,      0,       60}, // 总4096x1080(1x2 水平)--单(2048x1080 @ 60Hz) wide timings
	//{32484,  4096,    320,     1200,     26,      96,     64,     3,        5,      4096,   1200,   1,     0,     0,      0,       60}, // 总4096x1200(1x2 水平)--单(2048x1200 @ 60Hz) wide timings, mviewtech properitary timing
	//{24420,  4096,    320,     1080,     26,      96,     64,     3,        10,     4096,   1080,   1,     1,     0,      0,       50}, // 总4096x1080(1x2 水平)--单(2048x1080 @ 50Hz) wide timings
	//{27070,  4096,    320,     1200,     26,      96,     64,     3,        5,      4096,   1200,   1,     0,     0,      0,       50}, // 总4096x1200(1x2 水平)--单(2048x1200 @ 50Hz) wide timings, mviewtech properitary timing

	{25688, 3840,     320,     1200,     35,      96,     64,     3,        6,      3840,   1200,   1,     0,     0,        0,       50}, // 总3840x1200(1x2 水平)--单(1920x1200 @ 50Hz)
	{24750, 3840,     560,     1080,     45,      176,    88,     4,        5,      3840,   1080,   1,     1,     0,        0,       50}, // 总3840x1080(1x2 水平)--单(1920x1080 @ 50Hz)  low pixel rate
	{29700, 3840,     560,     1080,     45,      176,    88,     4,        5,      3840,   1080,   1,     1,     0,        0,       60}, // 总3840x1080(1x2 水平)--单(1920x1080 @ 60Hz)
	{23800, 3360,     320,     1050,     30,      96,     64,     3,        6,      3360,   1050,   1,     0,     0,        0,       60}, // 总3360x1050(1x2 水平)--单(1680x1050 @ 60Hz)
	{27000, 3200,     1120,    1200,     50,      128,    384,    1,        3,      3200,   1200,   1,     1,     0,        0,       50}, // 总3200x1200(1x2 水平)--单(1600x1200 @ 50Hz)
	{17750, 2880,     320,     900,      26,      96,     64,     3,        6,      2880,   900,    1,     0,     0,        0,       60}, // 总2880x900 (1x2 水平)--单(1440x900  @ 60Hz)
	{25272, 2800,     320,     1050,     30,      96,     64,     3,        4,      2800,   1050,   1,     0,     0,        0,       75}, // 总2800X1050(1x2 水平)--单(1400X1050 @ 75Hz)
	{20200, 2800,     320,     1050,     30,      96,     64,     3,        4,      2800,   1050,   1,     0,     0,        0,       60}, // 总2800X1050(1x2 水平)--单(1400X1050 @ 60Hz)
	//{14400, 2732,     268,     768,      32,      28,     112,    1,        3,      2732,   768,    1,     1,     0,        0,       60}, // 总2732x768 (1x2 水平)--单(1366x768  @ 60Hz)
	//{17100, 2720,     864,     768,      27,      128,    224,    3,        6,      2720,   768,    1,     1,     0,        0,       60}, // 总2720x768 (1x2 水平)--单(1360x768  @ 60Hz)
	{21600, 2560,     816,     1024,     42,      96,     224,    1,        3,      2560,   1024,   1,     1,     0,        0,       60}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 60Hz)
	{27000, 2560,     816,     1024,     42,      32,     288,    1,        3,      2560,   1024,   1,     1,     0,        0,       75}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 75Hz)
	//{30600, 2560,     816,     1024,     42,      32,     288,    1,        3,      2560,   1024,   1,     1,     0,        0,       85}, // 总2560x1024(1x2 水平)--单(1280x1024 @ 85Hz)
	{21600, 2560,     1040,    960,      40,      192,    224,    1,        3,      2560,   960,    1,     1,     0,        0,       60}, // 总2560x960 (1x2 水平)--单(1280x960  @ 60Hz)
	{16700, 2560,     800,     800,      31,      144,    256,    3,        6,      2560,   800,    0,     1,     0,        0,       60}, // 总2560x800 (1x2 水平)--单(1280x800  @ 60Hz)
	{13650, 2560,     320,     768,      22,      96,     64,     3,        7,      2560,   768,    1,     0,     0,        0,       50}, // 总2560x768 (1x2 水平)--单(1280x768  @ 50Hz)
	{14850, 2560,     1400,    720,      30,      880,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       50}, // 总2560x720 (1x2 水平)--单(1280x720  @ 50Hz)
	{14850, 2560,     740,     720,      30,      220,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       60}, // 总2560x720 (1x2 水平)--单(1280x720  @ 60Hz)
	{10378, 2048,     576,     768,      23,      80,     208,    1,        3,      2048,   768,    0,     1,     0,        0,       50}, // 总2048x768 (1x2 水平)--单(1024x768  @ 50Hz)
	{13000, 2048,     640,     768,      38,      48,     272,    3,        6,      2048,   768,    0,     0,     0,        0,       60}, // 总2048x768 (1x2 水平)--单(1024x768  @ 60Hz)
	{15750, 2048,     576,     768,      32,      32,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       75}, // 总2048x768 (1x2 水平)--单(1024x768  @ 75Hz)
	{18900, 2048,     704,     768,      40,      96,     192,    1,        3,      2048,   768,    1,     1,     0,        0,       85}, // 总2048x768 (1x2 水平)--单(1024x768  @ 85Hz)
	{8000,  1600,     512,     600,      28,      80,     256,    1,        4,      1600,   600,    1,     1,     0,        0,       60}, // 总1600x600 (1x2 水平)--单(800x600   @ 60Hz)
	{9900,  1600,     512,     600,      25,      32,     160,    1,        3,      1600,   600,    1,     1,     0,        0,       75}, // 总1600x600 (1x2 水平)--单(800x600   @ 75Hz)
	{11250, 1600,     496,     600,      31,      64,     128,    1,        3,      1600,   600,    1,     1,     0,        0,       85}, // 总1600x600 (1x2 水平)--单(800x600   @ 85Hz)

	// 1x1 单屏
	{15400, 1920,     160,     1200,     35,      48,     32 ,    3,        6,      1920,   1200,   1,     0,     0,        0,       60}, // 总1920x1200(1x1 单屏)--单(1920x1200 @ 60Hz)
	{14850, 1920,     280,     1080,     45,      88,     44 ,    4,        5,      1920,   1080,   1,     1,     0,        0,       60}, // 总1920x1080(1x1 单屏)--单(1920x1080 @ 60Hz)
	{13412, 1600,     160,     1200,     71,      48,     32,     3,        4,      1600,   1200,   1,     0,     0,        0,       60}, // 总1600x1200(1x1 单屏)--单(1600x1200 @ 60Hz) reduced blank from 120Hz version

	//	{21779, 3840,     528,     800,      31,      36,    192,     3,        3,      3840,   800,    0,     0,     0,        0,       60}, // 总3840x800 (1x3 水平)--单(1280x800  @ 60Hz_FD)
	//	{21954, 3840,     480,     800,      47,      144,    96,     3,        6,      3840,   800,    1,     0,     0,        0,       60}, // 总3840x800 (1x3 水平)--单(1280x800  @ 60Hz_RD)

	//	{13000, 1024,     320,     768,      38,      24,     136,    3,        6,      1024,   768,    0,     0,     0,        0,       120}, // 总1024x768 (1x1 单屏)--单(1024x768  @ 120Hz)
	//	{26000, 2048,     640,     768,      38,      48,     272,    3,        6,      2048,   768,    0,     0,     0,        0,       120}, // 总2048x768 (1x2 水平)--单(1024x768  @ 120Hz)
	//	{32380, 3072,     276,     768,      38,      48,     48,     3,        6,      3072,   768,    0,     0,     0,        0,       120}  // 总3072x768 (1x3 水平)--单(1024x768  @ 120Hz)
};



/***************************** MV102S_HDVI *****************************************/
//- MV102S_HDVI  HDMI输入的两屏宝  支持165M以下的所有分辨率， 且为非宽屏分辨率 
//-----------------------------------<<< 中文版 >>>-----------------------------------------------------------
#ifndef ENGLISHVER
CString m_MV102S_HDVI_strTimings[] = {  
	_T("2560x800  @ 60Hz(1x2 Mode 水平)(单屏 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode 水平)(单屏 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("2560x720  @ 60Hz(1x2 Mode 水平)(单屏 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("2048x768  @ 60Hz(1x2 Mode 水平)(单屏 1024x768  @ 60Hz)"),     /* mode 52 */

	// 1x1 单屏
	_T("1920x1200 @ 60Hz(1x1 Mode 单屏)"),	  /* mode 58*/
	_T("1920x1080 @ 60Hz(1x1 Mode 单屏)"),	  /* mode 59*/
	_T("1600x1200 @ 60Hz(1x1 Mode 单屏)"),     /* mode 60*/

	_T("END"),
};

//-----------------------------------<<<  英文版 >>>----------------------------------------------------------
#else
CString m_MV102S_HDVI_strTimings[] = {  
	_T("2560x800  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x800  @ 60Hz)"),     /* mode 47 */
	_T("2560x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x768  @ 60Hz)"),     /* mode 48 */
	_T("2560x720  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1280x720  @ 60Hz)"),     /* mode 50 */
	_T("2048x768  @ 60Hz(1x2 Mode Horizontal)(Single-screen 1024x768  @ 60Hz)"),     /* mode 52 */

	// 1x1 单屏
	_T("1920x1200 @ 60Hz(1x1 Mode Single-screen)"),	  /* mode 58*/
	_T("1920x1080 @ 60Hz(1x1 Mode Single-screen)"),	  /* mode 59*/
	_T("1600x1200 @ 60Hz(1x1 Mode Single-screen)"),     /* mode 60*/

	_T("END"),
};
#endif

TIMING_STRUCT MV102S_HDVI_detailed_timings[] ={

	{14350, 2560,     320,     800,      31,      96,     64,     3,        6,      2560,   800,    0,     1,     0,        0,       60}, // 总2560x800 (1x2 水平)--单(1280x800  @ 60Hz)
	{13650, 2560,     320,     768,      22,      96,     64,     3,        7,      2560,   768,    1,     0,     0,        0,       50}, // 总2560x768 (1x2 水平)--单(1280x768  @ 50Hz)
	{14850, 2560,     740,     720,      30,      220,    80,     5,        5,      2560,   720,    1,     1,     0,        0,       60}, // 总2560x720 (1x2 水平)--单(1280x720  @ 60Hz)
	{13000, 2048,     640,     768,      38,      48,     272,    3,        6,      2048,   768,    0,     0,     0,        0,       60}, // 总2048x768 (1x2 水平)--单(1024x768  @ 60Hz)


	// 1x1 单屏
	{15400, 1920,     160,     1200,     35,      48,     32 ,    3,        6,      1920,   1200,   1,     0,     0,        0,       60}, // 总1920x1200(1x1 单屏)--单(1920x1200 @ 60Hz)
	{14850, 1920,     280,     1080,     45,      88,     44 ,    4,        5,      1920,   1080,   1,     1,     0,        0,       60}, // 总1920x1080(1x1 单屏)--单(1920x1080 @ 60Hz)
	{13412, 1600,     160,     1200,     71,      48,     32,     3,        4,      1600,   1200,   1,     0,     0,        0,       60}, // 总1600x1200(1x1 单屏)--单(1600x1200 @ 60Hz) reduced blank from 120Hz version
};

#endif